represent
outlining
concept
semantic
similarity
caused
real-time
predictorsof
focus
existing
opportu
contains
aviation
ptv
displaying
reasoning
gi
compact
whose
zone
exploited
tv
connection
technique
self-organizing
extraneous
containing
environment
fine-grained
topic
program
scratch
mainte
pleasing
presentation
dramatically
assist
categorisation
case
lack
nisms
returned
advantage
desirable
implicitly
rise
subject
weighting
refine
non-uniform
affect
difference
vast
timely
entire
geo-sciences
level
transmission
issue
solution
large
item
geospatial
demonstrated
enhance
noted
programme
employing
illustrating
portable
speci
human-computer
heterogenous
cost
design
perspective
query
download
implemented
even
employ
predictor
combined
giving
scaffold
multimedia
contributed
overload
current
looking
experiment
new
learned
increasing
method
contrast
movement
supporting
segmentation
explosion
end-users
leveraging
promising
component
understanding
behaviour
reported
focused
separation
address
alone
lenges
strong
observing
implicit
box
search
involved
study
composing
allows
tegrating
experience
guide
fromexperiences
suggests
amount
resulting
browsing
usually
suitable
navigation
examining
via
useful
classification
requiring
rule-based
manage
brought
flexibility
apply
select
readily
use
discus
would
leake
nities
hospital
geo-spatial
two
next
comparing
sample
phisticated
asset
memory
afforded
assessment
achieving
distinct
separated
main
incorporates
relevant
becomes
fast-moving
periences
mismatch
distribution
phone
visual
carrying
everywhere
studied
particular
known
effort
capturing
must
evolves
account
include
orative
integrating
challenge
work
breuer
fÃ
dation
learn
growing
making
specialized
example
usability
compare
geovisualization
give
process
expanding
preserving
high
effectively
performed
dictation
endowing
yet
crucial
information
monitoring
goal
hinders
provide
mouse
discussion
endoscopy
feature
methodology
sig
answer
gate
widespread
intelligent
dependon
profile
map
inret-t
designer
explores
description
cross-container
may
proach
earlier
derived
mapping
produce
demonstrating
date
end
dublinâ
data
annotation
lar
aboutwhatan
realized
imagery
attempt
outline
effective
ptvplus
whenever
web-based
ablation
doctor
explicit
element
generic
complexity
healthcare
representation
subsequently
increase
order
typical
usefulstarting
executed
interpretation
help
hierarchy
developed
fall
argues
brain
paper
including
resentations
experimentally
existence
facilitates
still
avenue
developer
style
derive
group
fit
ptvâ
organisation
recreational
encapsulated
handheld
edge
better
platform
condition
automation
listing
criterion
retrieval
might
setting
good
return
greater
combination
seeking
weakness
functional
framework
resource
rental
day
maintaining
easily
term
t-ret
profound
content-based
always
presented
grows
capability
personalizing
difficult
characterized
successful
recommend
domain
transforming
another
profiling
generation
similarityassessment
reduce
related
static
ex
year
relates
operation
extract
lesson
category
shown
container
space
cerebral
open
integrates
selectcases
research
content
re
vector
safety
adapt
navigating
knowlÂ
problem-solving
adaptive
evaluation
integrated
decision-making
theory
retrieved
activity
little
standard
assures
reason
salient
formation
coordinated
plague
compass
point-of-care
generate
care
advance
training
interaction
knowledge-management
amplify
g
created
determining
could
retrieving
success
furthermore
filter
sourcesâ
thesecases
hindering
incorporated
isa
locating
facilitate
tentions
first
widely-used
algorithm-assisted
mr
saving
problem-solution
researcher
havethe
coding
number
one
cbm
improving
revolution
done
solutionsare
directly
impossible
remotely
quality
synthesizing
divided
three-dimensional
priority
given
management
limited
leverage
service
touristic
ordering
leading
interact
particu
detailing
system
supportsystem
electronic
needed
contri
scheme
store
pervasive
urban
mining
relationship
tool
acquire
contribute
accurately
immediate
biggest
part
proficiency
differentiate
manipulation
natural
tive
updating
center
wide
photograph
target
chal
annotation-based
namely
optimism
limiting
serf
systemshas
appealing
individual
video
tion
enables
nance
acquisition
interactive
function
addressing
fashion
geovisualizations
map-based
compile
dynamically
informationâ
manner
need
take
relatively
foundational
wilson
strength
recommender
built
exploratory
studying
routability
able
overcoming
thorough
also
potential
best
online
finding
performance
personalized
concern
competence
channel
accuracy
play
commonplace
multiple
though
customize
serve
consistency
sequence
chart
unobtrusively
extending
involving
assessmentapproach
significant
preliminary
device
coded
segment
adaptability
so-called
geographic
placement
especially
user-centered
mobile
medical
request
inferred
frameworkwould
face
traditional
manually
properly
refining
enterprise
professional
typically
intelligentsystems
quantity
precise
rating
currently
particularly
show
detection
off-site
tenet
discovered
learnÂ
planning
relation
suffer
ratings-based
recording
determined
availability
ground
impact
access
based
knowledge
theinteractive
implementation
much
guidance
3drg
state
case-base
symptom
equipped
integrate
employed
adequate
andcriteria
exploration
ranking
insight
dk
compounded
di
de
ventricle
yielded
simplistic
community
responding
sparsest
despite
report
high-quality
contextual
task-centric
regarding
querying
showed
generally
trospective
goal-directed
investigate
contain
implication
3d
automatic
view
preserve
requirement
set
art
constructing
exists
achieved
intelligence
condensed
relative
depends
computer
result
recommen
led
expertise
satisfies
incorporating
situation
bedside
project
learns
expert
attempting
managing
pattern
solution-to-solution
artificial
tend
enough
future
various
routing
intra-operator
drawn
whyimage
approach
across
tent
available
variability
infrastructure
end-user
ability
extend
web
importance
deliver
however
force-directed
efficiency
incident
le
key
butions
competent
modeling
andhowspecific
problem
improve
faced
c
accident
acquiring
leveraged
many
taking
aircraft
featural
merging
dimensionsfor
context
logic
long-term
operating
contribution
argue
experimental
case-basemaintenance
detailed
filtering
point
simple
overview
cf
mirroring
interface
dublet
adaptation
learning
article
associated
organisational
along
expensive
considering
web-browser
workplace
particulary
basis
create
three
evalua
strategy
subscriber
validating
describes
treat
maintenance
basic
expected
flexible
prototype
treatment
engine
direction
describe
diversity
powerful
proprietary
formed
personalization
non-proprietary
gap
adaptable
illuminate
planner
understand
proven
demand
designgeneration
improved
2drg
irrelevant
present
pilot
applied
physician
novel
unify
developing
efficiently
value
aim
ongoing
compactness
behavior
applies
aid
property
frustrating
region
characterizing
developingcbr
context-sensitive
played
almost
reproducibility
metric
thus
according
previously
personalisation
regularity
comparative
motivated
technology
around
capture
different
education
develop
prior
perform
suggest
make
medic
sourcesbeyond
pepg
toggling
prefetching
problem-to-problem
complex
potentially
widely
propose
algorithm
several
schlÃ
infer
higher
development
visually
satellite
used
reporting
collab
hand
sys
action
viewing
traditionally
portal
user
variance
opportunity
context-based
recent
relies
personalising
task
whereby
database
well
analysis
without
segmented
client
impediment
greatest
personnel
landmark
knowledgeaccounts
model
con
corporate
dimension
meet
ce
mechaÂ
aerospace
reliant
heavily
increasingly
storage
accurate
starting
detail
profoundly
proposes
shape
stored
identify
mechanism
aspect
world
inference
consolidate
caregiver
speed
proÂ
captured
previous
visualization
providing
application
tourism
asevaluation
large-scale
logged
entirely
source
interested
combine
attractive
context-aware
usage
input
extensive
item-overlap
smart
build
real
extraction
reuse
quire
spatial
possible
early
task-based
preference
burden
ultimately
using
tick
moreover
like
cbrm
specic
cognitive
sketch-based
identifying
exploiting
performing
customizations
addressed
server
specific
sparsity
benefit
continue
either
fully
popular
become
multimodal
fault
gauge
accessible
sketch
right
often
people
staff
manual
begin
library
growth
complete
recommendation
r
matching
recognition
synthesis
industrial
solving
describing
obtaining
demonstrates
decision
integration
per
interestingness
critical
market
provides
prof
themselvesuse
participation
locate
core
accessing
patient
repository
proac
fewest
continuing
analysed
step
eliding
hierarchyâ
rectly
relating
obscured
identifies
comparison
limitation
central
working
extension
constraint
introduces
recognized
simulation
practical
item-similarity
range
consequently
geosciences
automatically
software
therein
equally
computational
meagre
interfacing
civil
image
within
som
delivering
dataset
annotate
operator
accommodation
refined
utility
interactivity
rely
additional
area
measured
support
initial
question
textual
intention
board
seeker
low
way
forward
relationshipbetween
analyze
inÂ
wap
case-based
medium
human
interest
form
offer
impeded
becoming
regard
analyse
overlapping
searching
wireless
hierarchical
userâ
repeatedly
case-bases
significantly
considerable
observation
partitioning
made
applying
tems
evident
default
type
us
record
user-map
continuously
highlight
autonomous
piece
similar
called
reusing
diagnose
storing
medication
aerial
factor
computing
abstract
measure
generating
task-relevant
general
cbr
ap
examine
reliability
exist
rule
surveying
organizational
consistencyand
ing
combining
trip
constructed
mr-scan
compared
usersâ
ideally
guidefuture
scribe
hybrid
ne
field
supplementing
priori
role
digital
tie
superfluous
offered
conclusion
poor
nificant
collaborative
provided
state-of-the-art
measuresthat
systemsâ
helping
generated
important
log
serious
highlighting
structure
evaluates
building
reasoningwith
tailored
e
faster
prevalent
tested
expands
proposed
required
persistent
together
crease
reasoner
u
presenting
diagnosis
time
controlling
requires
rep
