limited
func
similarity
dynamic
reposito
four
sleep
consists
integrity
poorly
whose
calculate
eort
systemsupporting
tween
spec
incurs
petascale
replication
every
summarized
affect
solver
open-source
progression
suffices
cme
solution
inputdata
unrelated
enhance
porary
cmp
force
concise
lustre
consistent
bining
batch
feasibility
second
virtualization
targe
implemented
cooperatively
even
obse
hide
specification
selected
contributed
forreal-time
reconstruction
designing
messagesoverhead
new
net
increasing
ever
consisting
metadata
evolving
simultaneously
mem
module-level
refinement
protection
granularity
active
path
interpret
violate
obtained
nitude
forum
study
procedure
permit
adopting
suitable
besides
highly
mecha
unix
total
circumvent
linearly
experimentation
ccnuma
would
typi
overhead
asset
25th
assessment
dict
tolerated
standardized
naimiet
disruption
real-time
higher-end
blocking
must
me
word
mo
work
mi
ery
era
transparency
example
impose
wcets
give
iterative
preserving
currency
point
scheduling
keep
advancing
guarantee
recovery
quot
provide
verify
feature
machine
methodology
ent
techniqueof
significance
webqueries
lam
abstraction
modulation
proach
coined
lengthy
diagram
hence
mesh
ove
parallel
attempt
third
arbitrate
complexity
maintain
enter
order
restriction
executed
interpretation
feedback
centrates
vary
undetected
executes
concurrency
replicating
prefetching
better
constant-size
easier
overcome
versus
affected
combination
tained
safe
lator
finish
frameworkfor
analyzability
altogether
nested
ther
structural
represents
remaining
reasonably
l
software-only
tributions
lability
mean
signicantly
covered
fairly
series
ecient
long-running
bioforscher
pin-point
andindicate
gating
combining
publically
extract
array
multi-threading
networked
network
realtime
quantify
smt
ry
hidingtechnique
smp
re
dsm
ra
assignment
ro
forth
linear
resubmission
sheer
standard
sensory
detecting
supercom
ate
created
ontrol
lous
correctness
prefetch
incorporated
isa
onto
stripe
researcher
revitalization
primary
another
categorize
payload
illustrate
fastos
service
needed
confirming
tune
hypothetical
toolset
power3
ranging
ptimization
enhancing
predictably
tool
serve
yield
predictable
pre-determined
target
iteration
likely
project
idle
tion
enables
solely
acquisition
perspective
bridge
vector
modern
outperforms
manner
quency
unaffected
arbi
latency
traditionally
latter
blue
exactly
optimizer
committing
though
intra-task
glob
object
chronization
translator
extending
optimized
regular
cate
phase
assessed
typ
parting
padding
next-line
observation
health-deteriorating
consumed
partition
flow
schedu
tech
principle
full-tracing
consumes
prio
sage
speedup
gauge
stepping
availability
trade-off
layout
simu
ment
cross-platform
specify
comple
cryptography
di
air
de
scalable
by-reference
bothspatial
downtime
reconstruct
preemptively
contributes
cross-core
architecture
analytical
involvedin
automatic
programmatic
reference
sensitivity
testing
shared-memory
detection
depends
num
result
short-comings
microarchitectural
incorporating
subject
capacity
symmetric
future
muc
tolerance
wc
extend
rolled
however
ibuted
withinpreemptive
peta-scale
extent
toler
downgraded
topology
adapting
non-constant
sacrificing
met
fault
contribution
expense
com
col
con
portant
response-time
applicability
xity
data-flow
targeting
decoupling
basis
union
three
quickly
croarchitecture
much
replicate
progenitor
dynamically
website
load-based
life
trating
light-weight
coherent
lift
source-code
applied
tioning
publicly
gnu
messagesper
power-aware
n
employ
near
applies
stopping
aid
property
inspired
characterizing
cont
contrasted
tions
im
comparative
interacts
pointer
grown
containing
perform
make
complex
unrecognized
several
infeasible
independent
raid
differing
protected
opportunity
generalize
cycle
scenario
jmol
systemservices
client
resuming
simulated
quantitative
paradigm
bioinformatic
protocol
proposed
intentionally
distribute
assigned
proposes
bandwidth
identify
unifies
plug-in
yet
previous
adding
interfer
ease
hac
mask
passive
affinity
board
evidenced
outset
save
hat
puters
user-level
reuse
possible
theadvantages
fusion
unique
capa
advanced
occurring
measur
daemon
cache-coherent
havior
performing
manual
unnecessary
specific
arbitra
arbitrary
arecheaper
invaluable
security
anoma
beneficial
right
successfully
dead
transaction
statistic
dsm-threads
contributing
self-stride
unit
fol
exible
core
repository
posi
pose
executable
restructuring
shifting
architectural
non-real-time
difcult
run-time
o
visa
ensure
steadily
underperforms
lacked
runtime
automatically
raised
batc
presence
low-cost
obtaining
bound
tration
pair
sor
function-instance
inter-procedural
refined
reducing
tem
rely
preemption
compression
dispatching
support
initial
transform
one-time
width
conservation
way
call
on-line
callgraph
mptv
head
form
offer
forming
becoming
failure
multiprocessor
encoded
truc
especially
compositional
becomesincreasingly
staged
maximum
evictor
work-in-progress
fewseconds
atypical
proved
computing
abstract
exist
constructed
proaches
migrated
locality
na
generally
wher
setting
misleading
test
nr
nt
roll
node
alleviates
update
concurrent
tribution
parascale
variable
longer
assume
interval
worstcase
together
cache-related
time
serious
precedent
concept
remarkable
particular
focus
obviate
osi
manager
computation
plat-forms
ofile
9x
application-transparent
depend
tool-based
atiming
graph
technique
informa
environment
finally
promoting
sing
downloading
optimizedcode
advantage
choice
feasibi
sible
fault-tolerant
ma
little
exact
solves
presented
irreducible
team
signif
speculation
ries
der
dis
upper
slower
dj-graphs
trend
eclipse
htm
ubiquitous
prediction
cost
port
corba
programbehavior
uniform
current
sequential
shared
filled
data-cache
predicting
bluegene
understanding
enetic
address
alone
along
appears
change
knowledge
earliest-deadline
exemplified
healthy
impacted
studied
commonly
queue
simultaneous
throughput
approachworks
localitywithin
environm
visa-style
blcr
regardless
extra
multi-tasking
logical
ncur
discus
working
prove
tightly
optimize
live
opposed
memory
increas
scope
today
ritized
sharing
limitation
validity
enhanc
call-intensive
appendix
non-scalar
effort
protectedobjects
fly
instructional
ority
ibm
indicates
motif
facilitating
modified
www
atmega
growing
making
unconditional
usability
stream
predict
expanding
sample
incremental
posing
performed
unanticipated
penumbra
occur
of30
redundancy
monitoring
divided
reside
nyu
trace-driv
vital
criterion
fourth
optimal
allowable
tighterwcet
parameter
atmel
designer
explores
may
sacrifice
membership
produce
designed
mag
improving
mak
data
annotation
inter-node
stress
interactively
outline
whenever
sp
explicit
yielding
compressing
switch
sh
sc
representation
sa
asier
se
typical
approx
toward
actu
stability
ddition
crpd
still
ieee
derive
group
monitor
undermined
platform
earliest-deadline-first
policy
decreased
main
inefficiency
non
thereby
introduce
noc
scaling
chip-multiprocessors
well-suited
half
term
workload
realistic
ually
entirely
em
el
en
significantly
alatency
ee
ed
ef
ea
approximates
ec
replay
ex
entering
year
et
requesting
ep
shown
concur
space
profit
furthermore
novice
interference
increase
transforming
statically
health-inflicted
formula
sensor
correct
asymptote
ples
theory
symbolic
variant
mapped
invalidation
categorization
trace-driven
lossy-trace
org
remainder
advance
derivation
language
befor
recon
transition
programming
detectsand
place
massive
slot
warning
frequent
first
low-end
saving
striking
coming
safety
one
fast
directly
message
open
size
given
t
indicate
draft
national
niquesthat
exploring
fraction
mostly
accurately
broadcast
multicores
evolutionar
copy
representing
semantics
wide
translate
effective
require
smps
posix
accessed
proactive
pre
addressing
ana
405lp
pro
pri
recover
o-based
efficient
isolate
remapping
emphasis
potential
ditional
take
online
objective
performance
switching
multiple
trace
correlation
molecule
canno
invoked
proposethe
multiply
out-of-o
mttf
workstationswithin
considered
average
later
cution
typically
constructionof
quantity
show
synchronous
contemporary
merit
sustained
threshold
aggressive
line
gnat
specifically
ratio
best-case
enough
explicitly
threefold
helix
essence
invocation
awareness
viewpoint
assistant
membrane
simplistic
cannot
ssi
nearly
hecrtf
conjunction
gen
reveal
resource
outperform
sub-tasks
summary
predicted
ut
erform
gration
reveals
two-level
physically
sear
relative
intramolecular
eliminating
frequency-aware
concern
fails
detect
subsequent
behind
un
requiresa
affecting
developer
across
affordable
infrastructure
interprocedural
pthreads
laced
analyzer
sparc
concentrate
spare
analyzed
article
come
thread-aware
memory-bound
installation
implementing
many
region
according
called
enabling
propagation
expression
among
overview
por
period
exploit
vanced
constant
considering
tuning
capable
encryption
locally
distributedobject
production
combined
direction
enable
application-centric
thousand
formed
observe
wake
encapsulation
causative
former
case
folding
developing
trick
observationbased
fil
promising
investigating
eects
eral
microarchitectures
sleeping
cluster
regularity
argue
stabilityand
protein
technology
binary
different
lity
proto
locking
intelligently
authentication
pad
viding
physical
status
ofprotected
oil
trivially
same-object
assist
allocation
running
easilyusing
changing
nesc
relies
time-checking
minimize
rder
severe
without
extensible
on-the-y
inability
defers
model
execut
nd
guided
valuable
ch
speed
multi-threaded
ultra-scale
spmd
renewed
staging
thisrepresentationestablishesabasisfordetailedinterpretationofthe
trigger
measure
improvement
instrument
bloc
treatment
direct-mapped
scheduled
multicycle
mor
lowing
bcet
early
traffic
envir
scheduler
arithmic
using
execution
identifying
isscheduledandrecovered
collective
maintained
server
agreement
benefit
either
always
pipelining
inter
reduced
d-crpd
simulator
conditional
cache-coherence
calculated
shortcoming
specified
confirm
best
conservative
operationalcharacteristics
critical
expressing
unoptimized
scientific
power
retains
interleaving
communicate
notably
inherent
standpoint
kernel
comparison
central
ace
serviceability
discussed
generated
mixed
ov
processor
op
stric
interruption
communication
image
determine
accumulated
conceptually
log
area
removing
strictly
relocation
ode
low
deteriorating
transitioning
contiguous
programmptvis
resubmissions
complete
delayed
sophisticated
faster
applying
embedded
default
proactively
robustness
lyzer
isolating
reusing
detailed
ad
rve
migrate
certain
describe
al
general
ap
examine
reliability
asynchronous
file
corresponding
intra
fill
assessing
hybrid
multi-institutional
field
spatial
architectur
requested
briefly
includes
deriving
important
bounded
peak
included
remote
cally
u
parallelism
behavioral
original
represent
consider
prioritized
caused
lack
control-flow
splitting
code-positioning
executing
scalar
deadline
on-the-fly
edf
disk
acritical
responsiveness
tt
aggregating
tr
tain
program
health
immutable
introduc
adapt
global
ofthe
supercomputer
visa-compliant
mpi
worst
fall
bottleneck
condition
evaluation
reconstructionto
applicable
rency
large
adjust
distr
small
anal
portable
ten
prerequi
gnarl
past
rate
design
enhancement
coherence-analysis
entirei
compile
advantageous
section
retrofit
version
sup
tribute
method
contrast
revealing
millisecond
protocolfor
full
hash
checkercore
enabled
compilation
loose
component
operating
compressed
berkeley
ilize
observing
search
introductory
allows
experience
oduction
prior
amount
language-independent
interac
published
action
via
followed
debugger
family
requiring
leakage-oblivious
analyzing
aimed
examines
establish
path-based
select
conventional
distinct
tlb
two
comparing
taken
metric
minor
lowering
tasking
varying
known
knowl
largescale
parable
hour
fail-stop
equation
remain
v
obtain
history
compare
challenging
share
genus
uctuating
flexibilityin
information
stream-detection
interconnect
goal
utilize
ft
intended
derived
reflect
fa
accorded
develop
capitalize
response
profile-driven
workstation
short
approachis
resemble
parameterized
negligible
fundamental
parameterizes
vliw-like
nesting
help
ith
hierarchy
developed
offloadingandon-demand
trade
gauged
paper
ysis
ity
existence
suffer
paramet
style
translation
actually
absence
might
alter
ally
finer
molar
good
motivated
propose
anticipated
framework
cacheanalysis
easily
deteriorates
trary
purdue
fully
level
capability
diverging
execu
referred
subsystem
mental
generation
energy
hard
reduce
idea
numeric
extended
measurement
quantum
operation
beyond
event
steered
bility
missed
since
projected
research
periments
dominated
non-uniform
offline
issue
ass
micro-architecture
found
warm-up
proxy
reconfigure
put
generate
guest
driven
retained
thread
positioning
mean-time-to-failure
enforce
w
velop
feed
major
unhealthy
probability
encoding
diskless
relate
number
well-known
utilized
dfs
miss
tively
leverage
guaranteeing
utilization
leading
interact
construct
checkpoint
regulation
assumption
aver
hundred
store
lease
two-phase
option
para
preemp
part
ploits
focusing
tive
believe
nce
albeit
kind
scheme
determines
boundworst-case
cyclic
prevent
anticipate
instruction
cancoexist
determined
contrary
unprioritized
threshold-based
procedural
debugging
ofprefetch
average-case
programsin
vulnerable
lie
generalizes
depending
wallclock
also
recognizing
finding
peer-to-peer
proling
added
effecting
impacting
complementing
significant
easing
checkpointing
measured
distributedshared
decidepage
kf
exa
sometimes
cover
traditional
kp
caching
incur
particularly
boundary
minimizing
disk-level
fine
find
completion
indicator
simulating
writer
distributed
penalty
failed
providesan
factor
xen
numberof
ikely
non-determinism
compiled
adheres
interprocess
proces
b
sub-task
procrastination
closely
relational
emnets
restart
compiler
resolve
worst-case
gions
remove
investigate
lossy
common
activity
approaching
time-to-failure
set
art
achieved
ary
startup
achieves
collectively
nical
migration
theoretic
currently
underline
stall
various
architect
experi
numerous
schedulednon-preemptively
available
profiling
recently
complementary
targeted
complement
scalability
selectively
interface
encapsulate
relying
empowering
c
feeling
last
mega
single-task
connection
improves
context
extracting
whole
experimental
load
micro-architectural
supportsposix-like
large-scale
simple
schedul
onment
chedul
eviction
classof
adaptation
linux
expensive
pr
ensures
java
stamp
create
due
strategy
reduction
describes
initiation
ensured
combine
meeting
po
firm
toolsets
generating
non-preemptive
gap
determination
representative
systematic
demand
despite
floating-point
handling
look
straints
reliable
tolerate
budget
evaluated
receive
optimization
behavior
evaluates
guide
loop
real
costly
approximate
encountered
ric
ccsim
twofold
estimate
belong
wherein
shorter
widely
devised
modification
microarchitecture
educe
prerequisite
higher
development
wcet-enhancing
used
guration
forced
comprehensive
syn
sys
user
implementation
aggregate
fabrication
recent
multiplethreads
lower
task
database
analysis
concrete
edge
consistency
y
grid
parametric
out-of-order
precedence
theircontents
utilizesa
world
useful
alternative
reliance
accepted
long-latency
theoret
source
regimented
location
single-digit
input
transformation
single-issue
evaluate
showing
quest
integer
bit
erwise
contractual
per-reference
d
cycle-accurate
follows
hancementsto
separately
recons
imposes
indication
exploiting
popular
bystatic
essential
mithos
centralize
often
spring
creation
network-on-chip
back
prototyping
urgent
towards
duce
scale
describing
distributable
decision
novelty
per
behave
innovation
prob
minimal
slack-passing
run
processing
fed
stem
step
reduces
therefore
predictability
handled
pipeline
cilities
constraint
exaggerated
tracing
simulation
range
microsecond
supporting
consequently
sufcient
block
na√
conserving
computational
within
wcec
retaining
intr
aglobalview
proportional
next
hands-on
question
long
sub-petascale
analyze
etc
considerably
exe
alive
injection
altix
considerable
impr
ingly
partitioning
token-baseddecentralized
intuitive
characteristic
tocol
us
ur
preemptive
exploration
spectroscopy
continuously
highlight
capitalizes
requeue
similar
alarm
uc
schedulable
associated
reconcile
defined
proximate
single
diverse
irrespective
compile-time
rewriting
application
priori
functionality
becomes
arithmetic
nificant
potion
generates
calculating
benchmark
replace
providesa
allowing
eval
sider
structure
cryptographic
correlated
e
algorithm
age
required
resolving
crease
tradeoff
demonstrates
fresh
requires
dvs
code
partial
illustrates
scratch
existing
ge
legal
software-based
query
eradicates
compact
excludes
hierar
deterministic
granular
multicore
capturing
aditionally
suite
include
dramatically
indicating
provides
continues
dieren
bounding
continued
timely
entire
mode-enhanced
tra
to-analyze
integrating
fewer
try
what-if
related
smaller
extensibility
jump
replicated
leakage
expressed
overwhelmed
access
waiting
experiment
turnaround
microprocessor
selecting
equivalent
impact
non-linear
degree
respectively
gathered
cal
lem
following
explore
separation
openmp
implicit
extreme
technical
larger
suggests
time-preserving
resulting
implement
gene
involves
examining
decentralized
sgi
addressed
decrease
summation
apply
use
asymptotic
consumption
remains
adequacy
process
stage
optimizing
formally
sors
trait
capitalizing
mismatch
trail
transient
detects
high
account
intraiteration
portability
f
challenge
accrues
ecution
meet
control
loca
contempo
calculation
lock
ob
reconstructed
bene
ttempt
purpose
six
delay
reducible
gure
analyzingdata
instead
intelligent
profile
restructured
self-healing
whereada
farm
collection
buildinga
ow
demonstrating
observation-based
efficiently
chies
counter
element
object-oriented
time-stamped
synchronization
allow
subsequently
irregularity
least
stamped
insight
facilitated
produced
including
earliest-deadline-rst
facilitates
superior
le
exclusion
chosen
temporal
withina
choose
stalled
reflexion
sig
ically
pure
mote
outlined
practice
imates
turn-in
documented
transparent
university
identified
unpredictable
magnitude
mode
l1
identifies
homogeneous
schedulability
constitute
dy
frequency
static
exceeded
programmer
special
fundamentally
reboot
performs
adaptive
rea
cause
integrated
multi-mode
high-performance
maintains
greedy
powerpc
completely
rhead
icantly
full-featured
interaction
g
determining
could
synthesized
feasible
stride
timed
f-d
facilitate
exam
thatunifiesand
powerful
transaction-style
type
tributed
ected
interrupt-driven
micro-kernel
management
last-chance
ordering
unknown
system
compatibility
priority
ence
wall-clock
timelinessandprefetch
knowled
suitability
rst
overwhelming
observed
orchestrates
slack
center-wide
limiting
non-prioritized
ber
providing
steer
exhibit
false
terruptions
unchanged
linker
msec
ordinarily
unavailability
gigabit
need
constrained
linked
viewed
instrumentation
studying
able
si
mechanism
process-level
instance
multi-variant
consideration
educed
accuracy
brane
theanalysis
libraryunits
cipher
chitectures
device
segment
class
so-called
placement
refreshing
gather
request
hierarchical
rendezvous
constrain
fact
impression
emerging
highly-utilized
explicitly-safe
supported
tures
planning
predictabil
high-level
pause
based
unfinished
cache
middleware
prolong
reactive
local
achieve
slows
handle
familiar
overall
interoperability
coordinating
timing
fects
lossless
ffort
evolution
nism
cached
approach
tuned
whether
gram
avoidable
contain
tightening
fixed
grad
view
unison
enhances
requirement
temporarily
modulo
frame
module
operates
computer
enhanced
instruction-level
closer
in-order
exploited
feedbac
record
pattern
missing
hardware-assisted
favor
state
allotted
progress
neither
stati
comparable
ability
strided
eect
importance
efficiency
job
general-purpose
key
non-critical
configuration
xecutions
structions
itis
instant
staticcache
freely
assure
passing
estimation
safely
otherwise
relevant
wall
allocates
ce
packaging
modeling
respect
allocated
venn
cv
addition
underlying
acommon
genetic
real-cluster
recognize
utilizing
improve
anomaly
define
oth
diversity
namic
sufficient
coherence
controller
ensuring
spaid
coordinated
improved
present
novel
survey
unlike
cov
value
queuing
ar
transparently
determinism
layer
co-design
ve
inflicts
molecular
thus
site
surface
hardware
examined
lifetime
ave
conserve
capture
ofpredictabilitysuch
acet
difficult
conflicting
gauging
http
fast-os
upon
effect
automation
sults
sooner
student
v8
frequently
ponent
tighter
ofa
center
nevertheless
adapted
modeled
well
ofo
thought
procurement
cutting
hazard
instrumented
latest
arbitrarily
excessive
increasingly
storage
accurate
executive
hese
tcp
theformal
interim
voltage
predicts
coordination
low-level
on-chip
tight
supply
realize
battery
add
extends
attractive
ada
usage
grow
unprecedented
match
increased
page-placement
point-to-point
execute
prese
know
burden
deployment
immediately
loss
increa
lost
alternatively
qualitative
fpga
ecent
become
profile-guided
soft
page
replacement
accessible
exceed
sequence
software-instrumentation-based
reclamation
library
reasonsto
polynomial
growth
wcet
proper
asynchronously
lead
sufficiently
leak
avoid
overlap
sustain
assuming
demonstrated
locate
schedule
synchronizationin
real-world
architec
uated
consuming
inherently
described
approximating
r
simpler
gained
actual
fre
extension
high-end
freedom
certainty
introduces
piler
rary
insufficient
introduced
software
subset
equally
singleprocess
previously
tackle
single-system
thenumber
prefetched
eh
additional
signicant
transfer
appr
overestimate
variable-cycle
progra
ommitting
function
triggered
bus
eac
basic
ht
delivery
lowered
ho
automated
delivers
partially
count
made
compute
rc4
rc5
placed
limit
demonstrate
problem
piece
prole
curve
contribute
graphical
token-based
well-defined
readersor
ing
cmos
speculum
mutual
compared
oac
variety
detail
virtual
ofpthreads
branch
hpc
migra
variation
stag
chance
force-distance
incurred
identies
l-time
sidered
cpu
portion
approac
understand
4a
