limited
recall
concept
semantic
consider
chinese
similarity
v
dblp
particular
desirable
focus
existing
four
rapid
huge
consists
query
covering
preferable
fusing
row
hierarch
calculate
concerned
technique
contained
meaning‚
environment
fundamentally
finally
customizable
ontological
heterogeneity
presentation
case
supported
risk
derstand
far
dynamic
affinity
integration
ical
every
anonymous
tence
month
newly
tagging
entire
non-continuous
quantitatively
level
predefining
issue
dif
integrating
list
solution
correct
large
tap
vector
demonstrated
dealt
small
enhance
oaei2007
model-parameter
upper
employing
filtering
occurrence
completely
dealing
heterogenous
discover
literature
necessarily
revocable
heavyweight
design
perspective
pass
estimated
folk
canonical
even
aim
developed
power
euclidean
selected
learner
rbm
current
public
experiment
interactive
long-standing
conduct
new
net
method
contrast
metadata
freely
simultaneously
exchange
deduces
respectively
gathered
promising
component
interdependent
understanding
lack
refinement
explore
clustering-basedmethods
address
active
consideration
strong
respect
change
obtained
search
balance
study
studied
allows
pi
experience
guide
published
justice
amount
oriented
social
usually
opinion
implement
suitable
involves
query-focused
injecting
via
inference
classification
linear-chain
layer
logical
highly
addressed
aimed
polygonal-mesh
apply
semi-supervised
total
malization
estimate
select
forward-and-backward
use
refers
hierarchically
discriminative
concentrate
prove
centered‚
two
next
predict
data-independence
therefore
automate
unfortunately
taken
length
type
theoretical
separated
optimizing
sharing
formally
ambiguity
upcoming
furthermore
becomes
benchmark
validity
tested
insufficiency
big
informally
effort
already
capturing
latent
customer
high
account
enjoying
word
language
effectively
homepage
challenge
work
fast
sequence-based
blackmailing
labeled
paragraph
rately
www
learn
following
making
programming
example
performed
control
relative
performer
reserved
challenging
give
process
attribute
organized
pro
topic
indicates
four-step
tag
refine
past
phrase
simple
guarantee
information
high-confidence
goal
provide
comparing
verified
feature
relies
machine
strategy
trusted
answer
instead
intelligent
profile
map
lan
de
explores
description
capture
may
proach
mapping
collection
time-varying
produce
designed
participant
horizontal
law
data
annotation
engineering
efficiently
summarization
induction
natural
effective
coupling
whenever
quantify
parameter
two-layer
eliminated
su
assign
initiative
cascade
maintain
automatically
fundamental
correlation
subsequently
retrieval
talk
typical
played
feedback
single-strategy
hierarchy
indeed
insight
mainly
satisfied
entity
paper
including
supervised
statistical
converting
satisfies
still
eos
le
temporal
solving
authored
qlda
better
estimating
window
distinguishing
cross
hidden
main
defining
ally
colleague
good
modelled
combination
propose
recommendation
bound
break
framework
optimal
regulates
essing
realize
association
structural
develops
annotate
term
document
semantics
name
content-based
always
presented
guage
identified
labeling
correspondence
cached
token
magnitude
mode
multi-topic
graph-based
found
identifies
classifier
mean
subset
domain
weighted
retrieve
significantly
weight
generation
venue
hard
it‚
product
related
borrow
iasa
used
sponsor
combining
operation
beyond
extract
brings
really
predefined
depress
shown
accomplish
taxonomy
network
space
restricted
integrates
research
content
bm25
laid
investigation
staring
performs
internet
denoted
pendent
adaptive
evaluation
integrated
independence
architecture
dataset
creating
inputted
theory
team
little
quite
reason
base
bayes
org
detecting
publication
multi-strategy
training
interaction
g
geometry
half-million
could
filteringandtext
construct
feasible
counterpart
conducted
explored
circuit
signature
unformatted
velop
facilitate
support
four-layer
first
organize
industrial
utilizes
researcher
meet
number
rank
one
done
long
another
tcrfs
carry
anonymity
quality
size
given
management
discussed
service
swarm
introduction
unknown
top
system
approximately
compatibility
electronic
indicate
assumption
re-retrieval
participated
friend
prone
enforcement
mining
ogy
obtains
relationship
tool
shallow
accurately
disambiguation
prediction
sociable
part
differentiate
focusing
fuzzy
translation
representing
specify
detection
kind
inapplicable
third
keyword
summary
enabled
second
keyword-based
utilizing
project
minimize
future
contrary
direct
nature
accessed
tion
providing
treated
dstatcom
acquisition
extracting
manufacture
fashion
nlp
ignores
two-phase
duc06
viterbi
dynamically
expertise
generalization
tcrf
information‚
outperforms
folksonomy
supervision
need
elsevier
constrained
citeseer
clearly
multistrategy
traditionally
angle
mostly
academic
efficient
multi-view
latter
propagation
oaei
use-oriented
walk
extracted
intends
topic-based
build
online
finding
performance
effectiveness
explanation
accuracy
play
multiple
allow
object
reach
state-of-the-art
boltzmann
learns
propagate
specifi
significant
preliminary
pair
oil
cap
probabilistic
payment
coordinator
especially
unsupervised
neighboring
calculated
mediation
request
order
traditional
pagerank
clean
caching
calculates
brands‚
science
incorporate
selection
particularly
thorough
show
text
ontologymatchingplaysakeyroleforsemanticinteroperability
random
categorize
merit
ending
unbelievable
relation
keywords
hierarchic
d2
find
help
access
upgrade
based
knowledge
implementation
daily
guidance
cache
distributed
texture
minutely
reactive
theme
explicitly
implemented
rimom
rich
factor
integrate
various
b
local
achieve
ranking
intractable
mixture
correctly
ferent
get
dependent
vary
interrelated
datasets
interoperability
despite
report
homogeneity
fwrm
target
propagation-based
evolution
resource
showed
map-reduce
topic-level
ad-hoc
outperform
answering
across
plsa
influenced
crf
common
contain
plsi
maximize
3d
automatic
setup
view
large-scale
reveals
requirement
set
fair
achieved
intelligence
statistic
plausible
bookmarking
namely
computer
signifi
result
eliminating
reviewer
fail
sen
calendar
error-prone
best
concern
serf
satisfying
vertical
expert
cleaning
complementary
convex
formatted
label
symmetric
importance
enough
score
identification
cooperation
prune
invariant
boundary
approach
email
discovery
comparable
profiling
recently
ability
extend
word‚
targeted
missing
attention
citation
however
academicfolksonomysystem
characteristic
efficiency
ranked
p2p
key
genre
news
distribution
linkage
improve
pair-wise
received
c
improved
shape-similarity
many
taking
uncertainty
according
demanded
money-trace
enabling
etc
improves
context
collect
share
estimation
whole
experimental
component-based
among
would
relevant
extent
point
appeared
overview
named
others
community
sampling
dimensional
interface
exploit
ontological-information
simply
learning
modeling
table
instantaneous
flourish
conference
consuming
described
asks
basis
addition
create
constraints-based
ing
three
quickly
extraction
genetic
much
treat
interest
basic
combine
owner-trace
prototype
formalized
two-dimensionally
define
engine
field
generating
describe
corresponding
sufficient
formed
great
tures
co-authorship
observe
understand
representative
systematic
pcc
bayesian
assigning
former
present
applied
commerce
novel
heuristic
formalization
peers‚
plain
appearance
empirical
value
tree-structured
employ
cast
minimization-based
optimization
correcting
query-oriented
cannot
error
exist
properly
property
k
procedure
mistake
automates
resolved
ofnon-text
changed
ve
manually
null
thus
ii
cluster
bias
bridging
lightweight
annotated
ig
facet
different
svm
develop
baseline
considerable
author
perform
ccfp
make
accomplished
verify
minimal
complex
split
widely
weakness
distillation
several
infeasible
showing
conflict
difficult
development
independent
calculation
investigated
http
receives
facet-weight
unlabeled
comprehensive
browsing
upon
annotator
newsgroup
running
strength
user
frequently
laborious
normalization
framework‚
learner‚
task
gauss
scenario
database
duc05
try
depending
well
analysis
thought
person
without
solve
afap
consistency
undertaken
model
paradigm
dimension
preference
unified
lda
daml
protocol
proposed
sentence
dissatisfying
money
accurate
obtain
dose
assigned
proposes
shape
underlying
identify
atomic
aspect
world
useful
yet
alignment
previous
co-author
web
aiming
bibliography
campaign
candidate
instance
publica
ease
measure
recommending
improvement
topical
sensitive
extends
f1-measure
relevance
input
extensive
atomicity
transformation
match
take
real
subtasks
laundering
represents
situation
evaluate
enable
posed
possible
elapsed
pseudo
possibly
know
unseen
supervise
using
coincidence
moreover
like
loss
necessary
helpful
semi
identifying
envisioned
exploiting
reduces
performing
manual
user-defined
troduction
specific
informative
benefit
history
cantly
follows
popular
become
response
unbalanced
page
ontol
satisfactory
right
often
deal
people
absolutely
advent
sub-ontology
conditional
searching
library
transaction
global
regularized
onto
growth
hot-topic
specified
proper
server
matching
exists
investigating
confliction
separately
scale
represent
lead
sufficiently
decision
arnetminer
per
seller
critical
linearly
provides
prof
semantically
proc
booking
either
concept-sharing
noise
ce
minimization
sbwsdf
real-world
processing
confidence
oncepts
customer‚
although
output
peer
post
ontology
optimize
noisy
constrains
limitation
consumption
extension
constraint
initial
sepa
industry
folksonomies
introduces
generated
srl
simulation
compatible
dependency
ensure
greatly
shared
referred
block
software
na√
previously
relevant‚
within
year
commitment
cascaded
due
seller‚
phase
textual
voltage
determine
derive
annotating
nowadays
category
clustering
categorization
additional
edit-distance
museum
sequence
question
specifically
posted
spread
describes
low
way
interde
assumes
combined
function
complete
form
offer
becoming
similarity-based
thesaurus
overlapping
volume
hierarchical
gain
linguistic
classified
removed
statistical-learning
words‚
transferable
faster
also
acascadedapproach
made
partitioned
evident
whether
fwrm‚
objective
us
grasp
un
heterogeneous
demonstrate
problem
similar
called
reusing
distance
popularity
doesn‚
defined
certain
abstract
constraint-based
influence
life
avoiding
general
ap
single
non-text
well-defined
rule
unanonymous
flight
ship
explains
two-dimensional
constructed
tedious
looked
compared
users‚
ideally
n
commonest
individual
portion
numerous
application
interested
role
two-stage
digital
formalize
proposal
formaliza
rbm-cs
conclusion
node
requested
briefly
ontology-based
intend
collaborative
provided
update
precision
relevancy
meaning
important
log
describing
needed
structure
source
building
independently
validation
e
laid-out
algorithm
realworld
correlated
lot
cally
crfs
together
sonomies
partitioner
mergence
authoritative
self-learning
presenting
controlled-vocabulary
time
serious
osada
requires
avoid
