limited
dynamic
entropy
consists
whose
fine-grained
traffic-area
crossbar
emerged
theyare
considereda
replication
every
affect
onstrate
solution
vector
enhance
data-domain
cmp
chip-multiprocessor
specially
direct
likely
implemented
expressive
even
specification
selected
forreal-time
cc-numa
reconstruction
designing
new
increasing
ever
metadata
coefficient
simultaneously
behavior
consti
met
cult
path
xfs
obtained
study
suitable
glueless
highly
bi-dimensional
total
unit
would
theirimpact
negative
morecost-effective
mation
overhead
therefore
spike
type
successful
brings
proposalscompletelyremovedirectoryinformationfrommainmemoryandstoreitinthehomenode
real-time
ware
blocking
must
me
mb
work
ery
impose
myrinet
give
preserving
organized
scheduling
keep
unordered
guarantee
recovery
provide
describes
feature
machine
mpps
hot
widespread
lan
abstraction
minimized
demanding
diagram
modest
mesh
ploit
parallel
indirection-aware
effective
latencyor
complexity
maintain
ethernet
order
restriction
executed
last-level
two-level
innovative
personal
writing
better
production
mpich
easier
overcome
whichmoves
lator
bank
represents
l
side
mean
ecient
comprises
used
first-class
array
dfcm
multi-threading
reused
network
restricted
tried
smt
smp
content
re
rm
foundation
telecommunication
specint2000
standard
formation
estimate
mbit
computationtime
ish
onto
already
tokencmp
coding
20-stage
restrict
another
service
approximately
needed
master
percentage
ranging
enhancing
tool
implementer
wasted
past
second
tion
enables
metapredictor
entail
raw
achievedto
relatively
latency
traditionally
thoroughly
latter
oriented
causing
coherenceover
effectiveness
coarse-grained
timal
extending
optimized
entry
phase
mitigate
observation
medical
partition
flow
leakage-efficient
random
sage
speedup
keywords
effi
availability
trade-off
simu
steiner
implementation
explain
topological
integrate
adequate
rice
mixture
establishes
di
de
scalable
degradation
tiled
reversal
infrequent
covering
twice
architecture
release
automatic
tation
shared-memory
roadmap
detection
depends
num
result
microarchitectural
best
capacity
delphi
alsosuffered
smps
approach
howthis
adding
modify
however
structions
extent
improve
sacrificing
irregular
fault
uncertainty
participating
cod
ilp
logic
exceeds
expense
com
col
con
moesi
applicationsdemanding
appeared
basis
least-squares
sl2
quickly
confident
full-map
much
interest
µsec
expected
pro
life
deeper
concerning
applied
token-cmp
n
employ
near
k
procedure
tions
characterize
cant
recover
perform
suggest
make
drawback
split
evaluate
several
independent
vectorization
numerical
hand
cycle
simulates
maximizing
scenario
under-explored
paradigm
book-keeping
protocol
proposed
assigned
proposes
bandwidth
identify
yet
previous
ably
5x
ease
advancement
technological
consideration
match
reuse
possible
afore
erated
advanced
multicomputer
erential
specific
sparse
security
powerfulpcs
right
old
deal
successfully
qsnet
recongurable
dense
speed-up
particularity
core
hyper-threading
repository
ply
translated
architectural
peer
manufacturing
limitation
o
algo
slightly
automatically
presence
civil
obtaining
segmentsis
reducing
rely
compression
32-node
support
transform
width
way
medium
form
offer
becoming
fore
encoder
failure
multiprocessor
speed-ups
infor
inside
maximum
anew
prematurely
proved
computing
abstract
proven
floating
check
locality
whereas
generally
reality
role
test
tie
nt
shrink
node
update
in-excess
essary
dissipation
longer
together
time
serious
cellent
low-leakage
global
activated
focus
manages
computation
hold
depend
technique
environment
finally
gbit
division
advantage
orthogonal
choice
diporsi
ective
fault-tolerant
exact
quirements
level
die
solved
der
added
slower
trend
dealing
htm
repetitive
prediction
cost
corba
appear
directory-entry
sharer
current
sequential
shared
satisfy
tecture
upgrade
address
alone
along
appears
change
sending
pecially
studied
simultaneous
throughput
usually
ipc
penalizes
sharersfrom
useful
extra
simulationresults
market
handled
working
memory
high-speed
sharing
sglum
visual
affe
ibm
avoiding
achieve
cal
growing
making
figure
predict
chip
sample
single-chip
dropped
allowed
occur
divided
write
tile
optimal
parameter
map
designer
explores
huge
may
sp2
fed
spot
produce
designed
improving
data
accelerates
commodity
transactionalmemory
compressing
switch
portabil
representation
typical
deactivated
misprediction
mainly
unacceptable
nonparametric
wmpi
statistical
still
tending
group
interesting
low-cost
platform
window
constitutes
main
tory
non
introduce
scaling
chip-multiprocessors
log-structured
half
iments
now
maintaining
susceptibility
term
workload
revers
dico-cmp
em
domain
significantly
ex
year
avoided
er
predefined
shown
accomplish
container
space
furthermore
tutes
increase
rameter
statically
dominate
viable
invalidation
possibility
besides
org
dvfs
fabric
advance
psnr
recon
transition
programming
turn
interframe
place
massive
router
ture
frequent
first
intuition
saving
requirement
one
read-only
fast
directly
fi
carry
compared
message
size
given
remotely
indicate
cost-effective
exploring
excellent
fraction
mostly
cope
accurately
broadcast
atthe
reiserfs
copy
wide
translate
impractical
unfortunately
wormhole
fault-tolerance
require
hyperthreading
future
balanc
distributedreal-time
accessed
dium
dynamically
turned
invalidated
say
allel
efficient
vectorized
overcoming
emphasis
potential
take
objective
performance
channel
multiple
trace
opposite
price
paid
rationale
fcm
archi
especially
considered
average
gracefully
mispredictions
cution
duplication
precise
drastically
qos
show
contemporary
sible
threshold
distributed-memory
slow
ratio
dico
taxonomy
routing
get
cannot
nearly
sse
erent
conjunction
gen
gem
regarding
resource
yield
requesting
predicted
vision
ence
concurrency
rmt
physically
invalidating
concern
fails
detect
managing
subsequent
behind
geometric
infrastructure
pthreads
article
efficiency
many
according
duced
jfs
low-latency
among
afterwards
characterization
color
period
maintained
serialization
moreover
considering
first-level
combined
prototype
engine
enable
multicomputers
offered
formed
observe
telematic
former
case
developing
itations
promising
situation
interconnected
run-length
metric
duplicating
cluster
mispredicted
technology
thesame
different
develop
proto
pepe
viding
status
extended
time-expensive
driven
running
totally
six
without
solve
coordinate
model
tional
dimension
tiled-cmps
compromising
aspect
speed
captured
spmd
improvement
treatment
extensive
real
around
read
data-parallelism
traffic
reconfiguration
world
accepted
parzen
intel
reduces
exploit
server
facing
benefit
either
served
inter
reduced
interconnects
simulator
ezw
draw
cache-coherence
respect
matching
viral
confirm
critical
decomposition
provides
mathcal
moderate
scientific
business
interleaving
journaling
practical
full-system
estimator
greatly
act
mixed
processor
op
heavy
referenced
inclusion
communication
image
determine
nowadays
intervention
bpru
log
area
genetic
low
bpruto
rsim
e
applying
embedded
deadlock
detailed
ab
certain
describe
deep
general
ap
examine
intro
file
allocating
misrouting
storage
spatial
requested
important
suited
included
reduc
remote
ments
u
parallelism
single-processor
directory
cpu
represent
broadcast-based
consider
caused
executing
code
reconguration
disk
program
straightforward
far
induce
mpi
worst
mpp
pression
bottleneck
exploitedin
cable
andthereforethesecachecoherenceprotocols
3-hop
large
adjust
small
supportvery
ten
corba-lc
direc
rate
design
perspective
clock
gether
rithm
briey
version
method
contrast
full
component
opteron
behaviour
selective
operating
compressed
ver
canbe
search
allows
experience
amount
indirection
social
action
drrtc
family
requiring
unnec
analyzing
aimed
establish
simics
distinct
destination
two
taken
achieving
lowering
hard-limited
tested
basically
particular
known
projective
vp
keeping
equation
dem
v
compare
scal
stated
positioning
supercomputersand
cation
minimum
information
goal
non-scalable
distri
simplicity
plant
w
algebra
derived
par
dual-processor
connectivity
disable
numa
miss-ratio
response
macrobenchmarks
workstation
short
logtm-se
approachis
mpeg-2
sence
three-level
broadcasting
negligible
specifying
hfc
hierarchy
developed
signi
installed
thermal
paper
ity
style
solving
complex
absence
accelerateupgrade
good
motivated
propose
framework
presented
capability
micro
token
stopped
found
subsystem
energy
hard
reduce
idea
slowdown
non-tagged
obtains
measurement
state-preserving
operation
event
really
since
viability
research
induced
evaluation
occurs
ass
fiber
mance
enforcing
reason
sbf
put
sbi
thread
modularity
applica
circuit
consequence
exhibited
major
number
well-known
d-cmp
done
dfs
miss
differ
temperature
utilization
leading
least
dual-opteron
aver
scheme
store
pare
dimin
immediate
braries
part
kind
b
dcmpsim
instruction
faulttolerantmechanism
architect
maintainability
toward
randomly
topologychanges
substantial
elsevier
lie
depending
lim
transactional
also
empirically
interconnection
play
towards
electric
many-core
unused
significant
alpha
measured
kb
exe
landsat
traditional
optical
microbenchmarks
caching
sector
degraded
find
impact
distributed
penalty
factor
hit
distance
compiled
fastest
international
struc
compiler
submicron
remove
lossy
common
np-hard
set
achieved
intelligence
nization
achieves
mpi-delphi
close
currently
won
stp
avoidance
available
recently
missing
attention
scalability
parallelprocessors
selectively
interface
c
reverse
informatio
density
quantization
became
context
whole
experimental
load
power-saving
large-scale
simple
congestion
corresponds
dimensional
linux
expensive
non-state
due
strategy
pc
reduction
pa
coarse
understand
demand
assigning
replaces
conve
outperforms
reliable
tolerate
budget
evaluated
optimization
pressed
evaluating
error
evaluates
guide
loop
concurrently
unfea
execution-driven
verylikely
shar
informationhastraditionallybeenstoredinmainmemory
prefetching
reconstructed
widely
conflict
higher
development
literature
culus
amd
moment
user
robust
recent
lower
task
database
energy-efficient
analysis
consistency
y
organization
ation
infiniband
message-passing
up-to-date
reviewed
atomic
simd
alternative
huffman
flective
execution
majority
long-latency
guaranteed
source
location
input
build
photometric
big
showing
suffering
3d-conscious
correlating
formal
reusability
implemen
follows
translates
imposes
popular
essential
creation
back
streaming
tocompute
accelerate
delivered
scale
novelty
integration
per
connecting
eliminate
prob
run
processing
confidence
step
output
optimiza
relating
discus
pipeline
snoop
constraint
simulation
consequently
block
computational
within
appropriate
lesson
guideline
risk
clustering
multilayer
placing
long
custom
pared
suit
forward
analyze
considerably
link
line
balancing
characteristic
us
energy-efficiency
un
similar
called
storing
ordered
dualfs
single
superscalar
re-established
toachieve
coder
tectures
nal
application
functionality
networkscan
arithmetic
nificant
re-mapping
generates
provided
benchmark
generated
allowing
structure
independently
implies
algorithm
age
required
tradeoff
depth
presenting
redundantly
cmps
existing
edr
overlap
go
bpvp
meta-data
tocarry
stable
include
dramatically
sent
grid
severely
dimen
transmission
try
integra
chipmultiprocessor
video
leakage
non-redundant
thistechnique
power
soft-errors
multimedia
access
experiment
concisely
microprocessor
3d
respectively
leveraging
cache-to-cache
commercial
lem
desired
explore
focused
hasbeen
others
openmp
directory-based
implicit
great
resulting
ployed
implement
composed
named
appli
manage
private
api
decrease
apply
use
consumption
next
duplicate
vehicle
exhaustive
p-edr
comparison
becomes
efficientimplementation
transient
detects
customer
topic
account
augment
challenge
tency
performed
control
reserved
process
high
tag
bene
numberof
decaying
possibili
meanwhile
located
varies
sig
instead
titioned
third-level
demonstrating
message-based
efficiently
redundant
allow
subsequently
interconnec
evolutionary
move
produced
including
mentioned
perfect
le
ext3
lc
decay
chosen
temporal
li
timebetween
crash
contention
nience
snoopy
rotation
transparent
lotos
sufficiently
magnitude
l2
l1
modi
related
informa
static
measure
re-using
programmer
special
matrix
integrates
adaptive
cause
integrated
immune-inspired
high-performance
verylow
interaction
geometry
could
ever-increasing
feasible
stride
hence
hexadecimal
appropriateness
unrolling
fluctuation
third
unidirec
powerful
hurdle
multipro
owner
precisely
quality
management
revealed
system
ary
final
themeta-data
reversed
transistor
veloped
ber
negatively
providing
exhibit
enforced
gurable
tabu
coher
need
constrained
issue
studying
able
accelerated
mechanism
medium-level
instance
accuracy
calculus
ganized
preliminary
device
intrinsic
class
request
face
normally
fact
brute-force
supported
terministic
perfor
bring
based
cache
indeed
employed
local
inferior
cube
handle
overall
theinterconnection
suer
gray
tolerance
non-functional
processed
ification
fixed
enhances
workbench
reliably
halving
pabilities
computer
exper
closer
patternamong
pattern
notfeasible
state
wavelet
correctly
progress
neither
optic-coaxial
ability
state-of-art
deliver
cessing
implementing
general-purpose
key
problem
ext2
la
etc
passing
estimation
adjusted
relevant
author
cc
ca
table
ct
addition
medium-scale
cient
proposal
topology
corresponding
posal
coherence
implementors
controller
ensuring
sensed
present
multi
novel
unlike
harder
value
rectangular
reliability
supply
layer
thus
site
hardware
lightweight
partner
greater
productivity
generic
dierent
difficult
slave
effect
sults
andmeasure
frequently
variety
well
position
sensing
good-quality
xed
increasingly
hybrid
accurate
obtain
select
stored
voltage
web
on-chip
bution
point
add
extends
attractive
usage
ought
increased
checking
point-to-point
execute
know
immediately
loss
necessary
like
lost
exploiting
accelerating
become
replacement
drop
classical
sequence
library
corroborate
growth
home
lead
demonstrates
avoid
reconfigurable
assuming
noise
selecting
expansion
pressure
host
although
r
rare
carried
extension
getting
column
introduces
dependence
unidirectional
introduced
predictor
gshare
software
coverage
previously
functional
three
promise
dense-cmp
networking
additional
transfer
dropping
ensured
function
bus
basic
ht
made
placed
frequency
limit
demonstrate
distribution
sion
consumed
token-based
90nm
ing
ev
bpruis
percent
detail
virtual
lookup
branch
hpc
bpruin
cessors
variation
repas
additionally
2-way
using
original
portion
formance
augmented
