concept
partial
consider
generalthan
dynamic
existing
four
logic-based
generalize
higher
computation
parameterization
consists
follow
theorem-prover
integrity
reasoning
bridgeâ
inverse
subsumption
technique
program
mean-variance
include
indicating
applied
predicate
straightforward
theyare
verb
affect
difference
continued
condition
beginning
solves
presented
induction
list
applicable
large
item
small
ueda
upper
employing
force
occurrence
discover
horn
feasibility
second
design
query
coverage
implemented
expressive
even
hide
incompatible
giving
specification
selected
realizing
supplied
standardtactics
access
sequential
relational
learned
order
method
implementable
body
full
compilation
promising
modify
behaviour
others
represented
layout
along
change
obtained
derivable
search
respiration
suitably
study
studied
bot
contradiction
parallel-progol
suggests
rdb
suitable
cause
useful
classification
rule-based
logical
highly
logically
motor
apply
rarely
propositional
select
readily
conventional
db-amp
positive
contains
furukawa
negative
mgtp
call
therefore
msh
augmentedmsh
flat
initiated
started
becomes
company
benchmark
assimilation
validity
tested
actual
effort
goal
customer
hardware
word
thread
augment
work
self-applicable
bias
freedom
following
exhale
example
proof
control
indicated
stated
process
attribute
conjecture
high
incremental
refine
degenerate
constituting
unordered
looser
guarantee
information
redundancy
recursive
question-answering
feature
write
necessary
criterion
machine-learning
instead
ordinary
intelligent
simplicity
abstraction
tried
typewriting
derived
different
provability
designed
improving
meaningful
parallel
efficiently
realized
noun
succeeded
generator
counter
redundant
3-fold
ghc
representation
reinforced
playing
ilp
market
enter
hierarchy
developed
entity
structuring
paper
including
experimentally
existence
satisfies
level
machine
interesting
solving
biomedical
version
unbounded
potentially
main
defining
overcome
complexityof
affected
combination
propose
emden
introduce
framework
swork
realize
association
successor
easily
term
finite
name
university
classified
realistic
mode
found
clearness
domain
significantly
weight
generation
reduce
co-occurrence
solution
constitute
extended
expect
entering
year
substantially
et
programmer
extract
multi-processor
er
category
independency
space
rer
furthermore
since
research
content
groundatompositive
newly
induced
evaluation
ass
foundation
reformulation
theory
plotkin
mycin
standard
formation
put
inductive
generate
definition
unique
interaction
language
programming
keep
motion
turn
conducted
subconcepts
assign
first
major
already
kernel
clause
powerful
number
one
restrict
read-only
least
directly
precisely
metalanguage
given
management
bottom-up
indicate
data
examine
system
adopted
response
encourages
humanbeings
man-machine
passed
self-application
mining
way
relationship
introducing
tool
acquire
japanese
refined-entity-relationship
part
substitutionswith
focusing
believe
semantics
kind
b
target
keyword
project
empirical
enables
acquisition
extracting
entail
annotation
co-evolution
return
incrementally
say
categorized
clearly
foundational
issue
genuine
depending
efficient
mic
mechanism
also
internal
objective
performance
effectiveness
switching
accuracy
play
added
multiple
buffer
object
effective
extending
optimized
satisfying
preliminary
pair
evaluator
wisdom
measured
class
inconsistency
forjoint
give
especially
clear
later
instrument
retrieval
construction
principle
enterprise
notion
incorporate
selection
show
text
discovered
inconsistent
portfolio
non-terminating
fifth
ground
current
expressivity
based
knowledge
implementation
explain
assertion
failed
experiment
factor
employed
achieve
guarded
admissible
dependent
express
preferred
new
report
applying
conjunction
compiler
deductive
regarding
sensor
showed
h
knowledge-based
remove
investigate
architecture
activity
automatic
shapiro
set
computed
exists
acquired
intelligence
constraintsatisfaction
computes
computer
result
interpreter
skill
incorporating
fails
detect
expert
pattern
user
meta
definite
artificial
tend
case
converted
identification
correctly
progress
approach
email
discovery
preserve
oneâ
various
recently
creating
extend
heuristic
attention
however
efficiency
mshto
concentrate
hypothesis
key
interface
come
improve
suggested
toward
folding
strawed
many
according
deduction
ur-set
context
logic
interactive
whole
progression
experimental
relevant
stream
simple
overview
aspect
lsi
harmonic
invisible
learning
inhale
described
basis
addition
inclusive
literal
describes
basic
expected
utilizing
prototype
define
engine
direction
corresponding
top-down
sufficient
ensuring
understand
external
acquiring
present
sound
novel
formalization
developing
prover
evaluated
employ
evaluating
error
prolog
focussedon
allows
binding
ii
player
regularity
examined
claimed
completionof
technology
pruning
confirmed
author
make
another
drawback
inquiry
widely
document
difficult
development
oneof
used
thepresentation
hand
arrived
purpose
angle
totally
entity-relationship
center
database
shared
idempotent
well
analysis
academic
without
consistency
model
musical
proposed
sentence
repeatability
obtain
underlying
identify
human
immediately
inference
alternative
yamamoto
coordination
previous
web
like
clark
candidate
application
regarded
possibly
appeared
belongs
location
theorem
heavier
transformation
gave
increased
bâ
period
soundnessof
finding
background
using
apart
execution
formal
desire
assumedand
appearing
cognitive
performing
amalgamating
specific
security
essential
aimed
old
often
successfully
proper
orderlogics
operation
miner
connecting
lattice
provides
assuming
progol
augmenting
scientific
power
performed
processing
bk
step
substitution
bowing
discus
modularization
comparison
central
extension
constraint
text-mining
simulation
practical
dependency
ensure
act
generalization
gregory
zero-variance
withpreferred
computational
suited
communication
obtaining
bound
two
variable
appropriate
physical
previousstudy
support
unifies
opus
programmingrelies
generalto-specific
forward
music
function
tight
head
skillby
complete
form
regard
idea
properly
atom
promote
partitioning
compute
circulation
whether
inside
shown
muggleton
performersâ
arebased
cello
problem
deadlock
called
unfolding
computing
defined
certain
abstract
describe
al
general
single
childrenâ
together
check
constructed
entailment
mutual
compared
completeness
parlog
virtual
field
role
digital
test
revision
unsuitable
muggletonâ
calculating
symbol
update
deriving
concurrent
important
bounded
additionally
included
structure
e
algorithm
negating
rule
parallelism
diagnosis
time
asthrowing
backward
requires
original
extensibility
