limited
concept
semantic
similarity
particular
dynamic
focus
existing
computation
query
subsumption
graph
concerned
technique
meaningâ
environment
finally
enjoying
case
global
far
every
issue
list
large
adjust
per-use
prediction
second
perspective
estimated
employ
ned
learner
experiment
conduct
new
increasing
method
contrast
satisfy
simultaneously
reported
explore
operating
address
divisibility
configurability
search
amount
usually
named
classification
logical
addressed
use
contains
two
calculation
automate
type
today
introducing
successful
varying
effort
word
work
labeled
learn
making
example
performed
stream
predict
semi-structured
share
topic
indicates
refine
phrase
information
high-confidence
redundancy
feature
machine
ubiquitous
description
may
re-weight
collection
designed
summarize
data
lifecycle
efficiently
transitive
natural
effective
su
used
correlation
invests
order
typical
feedback
hierarchy
essence
entity
paper
including
committee
fit
reweighting
solving
platform
closure
dag
propose
indexing
introduce
framework
term
several
labeling
sufficiently
characterized
mean
subset
domain
weighted
retrieve
significantly
weight
related
extended
static
year
event
shown
space
restricted
research
laid
investigation
internet
adaptive
evaluation
story
mapping
base
detecting
training
g
could
diminishes
facilitate
assign
first
simplifies
number
one
done
given
service
indicate
system
compatibility
needed
re-retrieval
scheme
mining
relationship
accurately
overwhelming
keyword
extracting
vector
abstracting
dynamically
informationâ
outperforms
need
clearly
tdt2
implemented
multi-view
able
consortium
thorough
instance
potential
build
performance
accuracy
multiple
though
pair
intrinsic
class
adaptability
observation
traditional
hierarchical
calculates
show
text
supported
relation
keywords
based
knowledge
indexing-tree
integrate
various
local
awareness
made
prime
outperform
non-functional
common
contain
model-driven
view
requirement
set
exists
detection
result
fail
best
detect
pattern
definite
label
symmetric
enough
identification
approach
available
ability
importance
however
efficiency
ranked
tooling
key
modeling
come
linkage
improve
improved
many
uncertainty
according
context
logic
experimental
point
exploit
learning
news
moreover
considering
basis
computing
subscriber
extraction
interval-based
linguistic
utilizing
generating
sufficient
gap
systematic
present
applied
empirical
value
aim
optimization
property
inherits
thus
cluster
technology
ig
capture
different
baseline
make
split
document
investigated
practitioner
unlabeled
effect
tdt3
recent
task
well
analysis
academic
inter-related
model
charged
ldc
unified
proposed
isolated
assigned
underlying
integer
speed
previous
web
tight
adoption
extensive
momentum
know
reconfiguration
using
unique
necessary
exploiting
performing
specific
benefit
become
response
page
deal
conditional
searching
statistic
organizing
delivered
purple
saas
integration
business
processing
ontology
extension
industry
compatible
runtime
software
previously
relevantâ
within
functional
mere
probabilistic
support
specifically
much
low
way
analyze
manufacture
offering
volume
svm
gain
prefix-based
reflective
deployed
directed
also
datasets
algorithm
whether
middleware
problem
similar
flat
defined
describe
general
single
exist
ccfp
compared
storage
application
valid
gaining
update
generated
structure
tailored
correlated
e
partitioned
acyclic
required
partitioner
time
validation
original
