concept
caused
dynamic
splitting
obviate
technique
environment
program
suite
focus
differentiated
impressive
level
large
signif
dis
ten
splitsde
sign
rate
design
implemented
port
many-core
facilitatefast
gether
access
shared
atthememorypagegranularitybasedon
simultaneously
degree
mem
respectively
homecacheslice
box
study
studied
allows
gle
chitecture
queue
resulting
ploying
implement
generalizedmemory
manage
private
simics
conventional
discus
consumption
distinct
sixteen-core
two
multicore
therefore
memory
doubling
achieving
nuca
introducing
sharing
desir
brings
envelope
controlling
challenge
work
modified
tip-see
cal
processing
chip
high
effectively
guarantee
information
goal
provide
pure
sin
informa
may
proach
derived
mapping
designed
data
parallel
commodity
predic
last-level
hierarchy
paper
facilitates
lo
better
policy
overcome
tionphase
good
contention
propose
framework
mimicking
easily
term
workload
undertaking
l2
reasonable
l1
uninteresting
em
significantly
generation
energy
reduce
idea
related
mvrt
static
connect
event
ingsimulationresultscollected
network
spec2k
space
furthermore
crucial
research
performs
non-uniform
issue
ory
enforcing
million
existingtrace-driven
completely
trace-driven
icantly
manycore
ate
thread
16-thread
ture
first
omitted
number
thereof
specifically
tributed
miss
given
management
tor
enhanceloaded
system
needed
scheme
store
two-phase
wisdom
part
predictable
simula
eliminated
wide
effective
isolation
instruction
second
onmacro
future
tion
extracting
event-driven
pro
spectrum
raw
need
latency
built
efficient
able
isolated
mechanism
also
internal
interconnection
performance
accuracy
multiple
trace
intra-core
quantitative
phase
measured
placement
especially
average
later
caching
typically
show
speedup
carefully
aggressive
high-level
find
slow
based
simulating
implementation
cache
distributed
factor
achieve
de
overall
proces
time-consuming
timing
resource
adapts
comprising
architecture
gran
mapped
fixed
ence
reference
achieved
frame
testing
around
achieves
result
capacity
managing
mul
approach
implementing
key
modeling
andcache
improve
improved
many
os-based
experimental
con
load
among
filtering
pose
simple
linux
table
expensive
considering
full-system
strategy
reduction
much
tering
prototype
dynamically
enable
os-level
coherence
observe
present
multi
unlike
outperforms
cacheslice
value
ar
fil
behavior
error
scheduled
execution-driven
hardware
technology
reuse
shar
productivity
complex
modification
throughput
conflict
comprehensive
ticore
upon
allocation
running
compared
mips
opportunity
macro
well
without
impediment
simulated
five
model
tional
maximum-width
protocol
proposed
observed
obtain
proposes
aspect
integer
speed
yet
on-chip
application
to-core
mibench
save
bin
increased
evaluate
showing
posed
traffic
simulationap
using
execution
cycle-accurate
become
simics-based
inter
os-microarchitecture
page
interconnects
simulator
moreover
mentschemethatdeterminesthe
provided
tectural
slice
unlikemany
per
critical
detailedinter-page
refer
core
run
power
architec
architectural
predictability
extension
sidered
o
simulation
tailed
hardware-based
processor
block
generationphase
subsystem
tsim
previously
uninterestingarchitectural
preliminary
obtaining
sor
promise
determine
support
fast
incurred
head
offer
programmed
repeated
two-part
flexible
archi
computa
applying
characteristic
us
limit
problem
similar
called
detailed
evalu
certain
describe
ap
single
reliability
ing
ulation
proaches
hardwarebased
tpts
simulat
tim
branch
pronounced
page-level
prepared
structure
cpi
time
oracle
serious
ularity
