secondly
concept
partial
consider
chain
limited
aliased
caused
combating
dynamic
stochastic
existing
illustrated
generalize
computation
completelyviolated
follow
normality
denotes
reasoning
phenomenon
compact
content
dimensionality
duction
similar
graph
description
equivalence
informa
tain
finally
ofproblem
certain
th
arranged
include
tc
data-driven
case
supported
returned
advantage
desirable
construction
learned
eectiv
handling
abduction
experimentally
little
exact
convexity
identity
severely
dimen
unlike
presented
transmission
strategist
dif
f
solution
integrated
large
discrete
adjust
demonstrated
dealt
small
study
markov
experiment-based
noted
prevent
smaller
abil
ten
dealing
ted
prediction
adopting
d
approximation
elegant
higher-order
link-based
perspective
interpolated
manipulating
n
long-run
even
established
classication
unavailable
compar
thecandidate
specification
posi
brief
supplied
current
diagnosing
version
classiflcation
selecting
relying
new
model-based
increasing
boost
method
revealing
multivariate
remem
shutting
transparency
degree
whose
indicates
gathered
socio-economic
retrieval
lem
water
modular
explore
address
alone
consideration
standard
change
obtained
sending
convert
medium-sized
di-culty
technical
involved
inspired
adjusts
allows
commonly
leaving
significantly
suggests
accomplished
time-delay
resulting
terrorist-related
published
usually
dfcsp
approximator
suitable
cause
composed
technique
useful
classification
win
rule-based
layer
marked
highly
utilisation
addressed
fraud
decrease
aimed
achievable
conditional
rsar
kernel
select
readily
conventional
discus
would
remains
positive
random-based
readable
two
thepredictor
comparing
therefore
length
exhaustive
simpler
flnd
theoretical
modelbased
almost
face
formally
generate
successful
becomes
classi
solutiontechniques
limitation
plant
glass
fixed
rigid
descriptive
particular
parison
dicult
effort
blocking
must
abundance
involve
alisation
multi-rate
pre-processor
integrating
science
past
work
disaggregation
fast
remain
minimum
conventionalconstraint
busyness
v
following
field
criminal
example
refine
control
alternating
compare
reserved
degenerate
process
attribute
discovery
high
effectively
imizing
ignore
avoid
hyperplane
proof-of-concept
specific
tions
nonnegative
ideology
ratio
information
respective
redundancy
monitoring
recursive
locates
pure
provide
divided
di
pressing
feature
machine
located
methodology
vital
adjacent
significance
instead
ordinary
guarantee
classiers
csp
backer-upper
eal-world
simplicity
applicability
mar
intended
utilise
huge
may
proach
sacrifice
variant
containing
collection
cation
reflect
membership
mesh
designed
demonstrating
insufficient
improving
criterion-referenced
data
flexible
goal
induction
attempt
effective
fuzzy-rough
whenever
direct
conduc
sensitive
correspond
attainable
mark
complexity
cannot
truck
block
allow
decreasing
challenge
representation
first
order
typical
restriction
saturated
help
webpage
indeed
move
mainly
satisfied
utilize
produced
whilst
paper
including
two-level
ity
still
ieee
path
pca-based
multi-dimensional
manageable
group
personal
continued
temporal
solving
co-ordinate
transport
mbd
flank
choose
inspecting
serious
main
might
setting
versus
good
return
non-realtime
thereby
fragment
powerful
operatio
primary
framework
wmns
optimal
determines
multidimensional
tegrated
maintaining
intotask
growing
term
document
hop
name
content-based
intelligent
retrieved
classified
biweight
realistic
le
magnitude
outperform
found
interpolation
classifier
classifler
mean
subset
status
domain
en
another
formulate
classifying
generation
scheme
frfs
hard
reduce
approximates
scriptions
applicable
operator
used
static
examined
entering
measure
rts
assumption
operation
differ
extract
event
er
category
shown
taxonomy
network
human-readable
realtime
alleviated
restricted
integrates
since
research
increase
re
contained
investigation
imperative
max
urgent
adaptive
illustrate
evaluation
semantics-preserving
common
occurs
sented
theory
largely
redundancy-removing
derived
cre
cer
sheer
quite
measurable
completely
base
complicated
theseissues
non-normal
put
deceptive
likelihood
algae
mrpc-routing
definition
training
interaction
retained
rs-based
route
renewal
mac
validsolution
feasible
bookmark
conducted
produce
exponentially
ltd
hence
retain
purpose
sionality
major
simplifies
ntroduction
utilizes
probability
predictive
stantial
symbolic
number
rank
one
production
utilized
employing
done
thediagnostic
proposing
impossible
message
quality
tively
stage
size
given
symptom
exists
service
thirdly
introduction
unknown
moderately
system
construct
response
priority
intermediate
compromise
short
corpus
rather
final
store
activity-based
challenging
cope
distribution
explanation
continuous
preprocessing
selector
employ
part
model-building
rst
fuzzy
downtime
undoubtedly
semantics
population
distance
level
b
ns-2
efiective
keyword
require
forensic
tree
rate
modeller
r
exclusive
light
ber
tackled
tion
outcome
weighting
nding
acquisition
exhibit
case-based
andmodel
vector
false
behavior
outstanding
information-rich
disambiguation
alongside
beforehand
defect
ant
medical
simultaneously
close
need
seen
set-assisted
seek
relatively
first-order
strength
computationally
built
mapping
efficient
latter
able
time-stamped
mechanism
delayed
also
empirically
potential
take
neither
performance
effectiveness
tool
channel
accuracy
towards
multiple
fundamental
combat
visu
vibration
object
sequence
difference
simplify
involving
plan
significant
preliminary
retaining
represen
class
damage
sub
volume
tasksperformed
tional
relaxes
especially
url
parametric
clear
later
coincides
damentally
contention
dimension
traditional
hierarchical
organise
spatial
uniqueness
estimator
caching
link
constrain
typically
dow
fact
slope
pattern-based
selection
qos
somewhat
show
text
retains
random
design
techniqueâ
rotating
incorporates
satisability
planning
end-to-end
turbomachinery
sub-system
rector
keywords
rough
determined
find
decade
principal
impact
slow
based
knowledge
implementation
explain
crime
terminal
experiment
black
guide-lines
rich
developed
employed
accurate
enabled
represent
regularly
insight
handle
reduc
viewpoint
wide
pendency
de
countered
soon
next
signicantly
made
aforementioned
competing
compute
hedge
conjunction
ds
differentiating
increased
categorises
cached
approach
reliant
modern
knowledge-based
chaining
consisting
compositional
stored
processed
granularity
ality
scusses
river
automatic
gde
available
requirement
set
art
tation
reference
achieved
intelligence
intelli
between-group
packet
plausible
namely
individual
result
matic
fail
explosive
considered
situation
detect
capacity
interacting
expert
attempting
pattern
review
nature
propose
artificial
tend
e1ective
state
unable
identification
routing
backoff
progress
boundary
tolerance
tent
preserve
forward
various
recently
ability
relative
heuristic
business
component
prior
combining
however
interpolate
ison
efficiency
concentrate
implemented
huang
distinguish
rapidly
pre-process
theconstraint
reaction
providing
improved
throughput
reported
many
region
penalizing
equal
quantization
enabling
characterised
improves
posse
context
logic
estimation
adapted
adaption
experimental
otherwise
pre
filtering
simpli
extent
cm
point
simple
overview
deal
relaxation
colony
addressing
community
dimensional
represented
exploit
fashion
adaptation
learning
article
respect
trust
considers
expensive
ct
applica
furthers
strong
described
second
capable
addition
due
strategy
underlying
ely
reduction
much
ruleset
maintenance
basic
collected
linguistic
improve
proficiently
engine
box
graphical
enable
general
efficacy
threshold
mind
thousand
skewed
exposed
search
modelling
norm-referenced
comprehensible
ordering
representative
systematic
bayesian
last
despite
resultant
former
present
applied
highest
novel
uncertain
exponential
flnding
hoc
reliable
prominence
value
fies
aim
optimization
encountered
evaluating
fault
fun
aid
ful
property
falsified
reme
procedure
entropy-based
pca
detailed
uncertainty
examines
quired
coupled
ofsystem
metric
ir
thus
real-valued
characterize
unit
obstacle
experience
elsevier
comparative
activity
technology
regression
diagnostic
proposi
capture
different
terrorist
develop
justification
dilate
perform
make
highlighted
complex
potentially
widely
auto
modification
survey
several
composition
conflict
difficult
development
sensing
rule-base
literature
closest
numerical
upon
impediment
average
running
investigates
user
student
opinion
implement
stituent
recent
mrpc-mac
lower
task
dying
scenario
neural
com
mrpc
well
analysis
thought
academic
without
solve
machinery
alleviate
simulated
inability
model
con
essential
drawing
non-trivial
meet
protocol
graded
proposed
among
transmitting
generally
observed
obtain
valuable
extrapolation
proposer
proposes
bandwidth
via
identify
thanks
human
world
inference
cross-layer
speed
yet
electronically
previous
web
like
acquiring
candidate
instance
admission
large-scale
mask
gence
source
book
combine
easy
theorem
relevance
input
extensive
prominent
transformation
mamdani
real
usable
probabilitiesâ
casting
reuse
depends
easily
devised
discretisation
preferred
possible
topology
early
ferent
traffic
preference
background
using
approachesmay
formal
meaning
loss
satisfaction
crisp
specie
success
identifying
controlling
signal
reducer
flexibility
translates
facing
informative
benefit
transform
sparse
become
page
grouping
mathematical
weight
right
often
classical
people
shen
successfully
identified
supplementary
interarrival
growth
shortcoming
text-based
statistic
interpolative
practical
recognition
industrial
provided
scale
describing
rrdfcsps
set-based
unreduced
demonstrates
decision
normal
integration
per
e-mail
rewarding
critical
decomposition
moot
provides
repository
transformation-based
allowing
three
analyzed
prob
minimal
constructing
locate
contrasting
denominator
minimization
database
performed
real-world
processing
use
restrictive
step
reduces
although
inherent
similarity
relating
refers
ignored
noisy
chapter
comparison
aca
actual
carried
extension
constraint
freedom
basis
aco
chance
simulation
compatible
dependency
range
misleading
greatly
time-consuming
reward
introduced
deployed
automatically
pollution
repair
discretization
trapezoidal
consists
firstly
previously
asystematic
within
functional
dataset
included
appropriate
intra-flow
computational
reducing
spline
physical
utility
performing
rely
categorization
computer
additional
area
support
initial
question
friedmanâ
specifically
approved
lost
describes
way
suit
resulted
developing
imposed
eectiveness
function
considerably
carefully
creation
interest
offer
great
becoming
minimise
simulator
triangular
extended
gaussian
wireless
expected
properly
incorporation
catalyst
automated
ling
e
ns2
editing
true
considerable
illustrative
observation
condition
partitioning
datasets
applying
qualitative
embedded
society
whether
characteristic
best
enables
ystems
us
placed
trading
limit
verification
demonstrate
problem
issue
called
high-dimensional
required
associated
ad
defined
inadequate
abstract
describe
incremental
generating
hardconstraints
evidence
ap
together
formulation
controlled
modeling
ing
extends
rrdfcsp
vertical
extending
compared
tâ
polygon
maintains
variety
credibility
image
hybrid
power
application
valid
bell-shaped
brings
test
predominant
constraining
conclusion
node
maximizes
draw
generates
behavioral
carrier
concurrent
ecological
important
nre
additionally
axiomatic
variable
approachwhich
score
aggregated
structure
matrix
building
antecedent
suffers
catagorisation
algorithm
tested
expands
solver
space
curve
persistent
rule
veried
safe
diagnosis
time
incorporating
computer-based
requires
original
smallest
