code
chain
similarity
disima
global
existing
four
gf
spacecraft
self-concatenated
gc
computation
go
query
whose
3-dimensional
inverse
graph
concerned
technique
containing
finally
uniquely
stable
awgn
applied
digit
supported
8-psk
advantage
orthogonal
synchronous
continues
two-user
choice
gallagerâ
reordering
fall
closed-form
difference
exact
condition
illustrated
turbo-coding
level
transmission
evaluation
list
solution
cascading
large
p
vector
minimal
small
upper
approximately
katsman
direct
literature
modified
past
second
cost
design
value
nonhomogeneous
implemented
odd
uep
quite
belief
even
sub
rate
sum
expressed
decoding
current
subcodes
transmit
designing
new
hyperplanes
method
implementable
satisfy
full
bit-error
ibid
applies
component
desired
packing
protection
others
represented
ratio
soft-decision
strong
obtained
decibel
search
balance
reliability-based
shift
study
larger
allows
survey
within
permutation
kotter-vardy
suitable
composed
appropriately
reprocessing
formulated
useful
family
requiring
contrarily
flexibility
sloane
achievable
linearly
conventional
done
additive
discus
codewords
mrb
contains
two
tightly
next
almost
overhead
memory
exhaustive
simpler
type
theoretical
decomposable
convolutional
turbo
duality
composite
line
tested
particular
known
projective
hold
effort
16-psk
worst
word
ml
lrb
remain
codimension
v
meet
example
control
nearest
triple
synchronized
give
process
andx_
regarcred
high
synchronism
minimum
protects
multi-scale
sense
every
reed-solomon
serial
information
syndrome
fpgas
syntactic
provide
protect
divided
six
conducted
arrangement
delay
criterion
simplifies
gate
parameter
sim
plant
binary
modulation
db
earlier
derived
mapping
diagram
xilinx
snr
designed
anddelta-decodable
develop
minimizes
data
parallel
efficiently
short
multiple-access
third
whenever
approximation
register
quasi-synchronous
element
berlekamp-massey
complexity
maintain
progressively
allow
decreasing
sc
representation
bpsk
order
complementary
help
ith
hierarchy
developed
insight
constrained
primitive
paper
including
two-level
satisfies
superior
position
outer
probability
chosen
interesting
random-like
suboptimal
better
bose-chaudhuri-hocquenghem
pcm
interdependency
correspondence
good
greater
coding
practice
indexing
framework
optimal
resource
rotation
transparent
considerably
structural
easily
term
document
always
reasonably
presented
add-compare-selectâ
capability
2n-state
theory
transmitted
h
2m
2h
2k
em
retrieve
significantly
weight
generation
eg
hard
reduce
gaussian
related
constitute
used
divide-and-conquer
combining
et
approximated
tenth
event
special
shown
matrix
multi-stage
furthermore
since
squared
systematic-circulant
increase
may
branch
rm
adaptive
issue
independence
linear
m-1
mapped
little
free
standard
error-correcting
reason
t-error-correcting
put
span
asynchronous
likelihood
finite
enormous
fixed
derivation
lrb-based
geometry
finite-geometry
iterative
bibds
hard-decision
m-ary
length
deaett-wolf
encodable
low-complexity
circuit
unknown
hence
first
already
saving
surviving
encoding
relate
dynkin
powerful
number
majority-logic
one
well-known
symmetry
smaller
simplified
long
directly
impossible
message
fossorier
idea
phase-shift
given
salient
asymptotic
likely
ordering
meaningful
interact
structured
system
least
gallager
needed
x_
ary
white
scheme
ranging
low
excellent
fraction
relationship
centered
exactly
proving
broadcast
part
1960s
constituent
representing
x4
distance
self-concatenation
cyclic
low-to-medium
require
iteration
zero
dtd
even-length
r
punctured
achieved
mini
decoded
viterbi
correction
ram
measure
5x
generalization
randomly
outperforms
say
suboptimum
manner
dictate
impacted
relatively
togonidze
decomposing
estimated
trellis
output
efficient
vectorized
lin
able
investment
also
potential
generalized
finding
performance
channel
multistage
multi-precision
multiple
cosets
buffer
object
fails
algebraic
regular
connected
adder
significant
codeword
phase
encoder
probabilistic
class
bsc
so-called
near-optimum
unequal
especially
considered
average
m
two-step
properly
principle
hamming
pattern
communication
latest
bounded-distance
incomplete
gain
precise
particularly
show
random
downlink
speedup
decode
2-state
single-stage
range
font
find
feedback
symmetric
trade-off
based
knowledge
spite
implementation
explain
texture
analytic
smallest
attained
passing
constant
importantly
achieve
erasure
multi-user
dh
wide
stop
scalable
degradation
b
despite
conjunction
sm-psk
geometric
gray
regarding
bar
introduced
trellis-based
differential
shape
yield
derive
qc
common
double
x
2k-1
tuÅ
error-floor
set
modulo
constructing
exists
burst
catastrophic
frame
testing
high-channel
achieves
collectively
see
computer
radius
result
error-correction
close
optimum
best
keying
permuted
capacity
degree
preprocessed
subsequent
away
hybrid
formatted
distance-8
state
determined
various
masking
conceptual
invariant
boundary
approach
fpga-based
sectionalization
nature
importance
second-order
however
synchronizing
implementing
le
hypothesis
subgroup
analyzed
group
problem
improve
received
c
improved
candidate
irregular
many
region
equal
propagation
subcode
nonbinary
multistep
receiver
contribution
expense
decodable
experimental
arbitrarily
among
filtering
point
simple
recursive
address
cross-sectional
simply
block-modulation
article
polynomial
respect
iâ
qpsk
vÂ
described
m-psk
basis
addition
three
strategy
pb
exhausted
reduction
much
c_
combined
interest
basic
combine
location
firm
decomposed
corresponding
1950s
nikov
sufficient
precision
near-optimal
bit-position
optimality
systematic
repetition
present
reliably
case
k2
multi
novel
resulting
time-shared
reliable
circulant-ldpc
empirical
evaluated
n
employ
euclidean
near
optimization
evaluating
error
stopping
situation
revisited
property
k
procedure
girth
computed
shortened
generate
studied
approximate
psk
vol
metric
thus
according
dual
technology
examine
sum-product
plant-level
different
recorded
macwilliams
reed-muller
author
perform
make
fewer
shorter
widely
propose
modification
algebraic-based
several
circulant
higher
independent
satellite
investigated
closest
numerical
monotonic
emanating
encoders
investigates
user
extendible
sub-images
conveniently
tighter
cycle
low-weight
lower
fourier
analyzing
shared
expression
addressed
floor
well
low-rate
analysis
without
combinatoric
simulated
y
ilarity
model
dimension
left
unified
construct
proposed
storage
accurate
slippage
obtain
bandwidth
stored
aspect
integer
alternative
converges
speed
yet
previous
overlapped
renewed
signal
generator
application
wei
sr-tree
guaranteed
except
node
improvement
color
adoption
attractive
easy
theorem
input
remaining
take
real
circuitry
around
represents
devised
showing
digital
possible
spanned
early
nonsynchronized
five
know
ldpc
using
bit
correcting
formal
loss
necessary
systematically
exploiting
reduces
performing
exploit
maximum-likelihood
specific
transform
fpga
either
fully
decrease
one-step
soft
reduced
parity
right
binary-cyclic
sequence
blokh-zyablov
successfully
l
hartmann
statistic
proper
low-density
translates
matching
provided
qc-ldpc
decision
minimum-weight
parity-check
subclass
decomposition
provides
direct-sum
order-0
redundant
moderate
noncatastrophic
sub-image
noise
late
equivalent
processing
use
step
binomial
quasi-cyclic
although
found
manufacturing
stage
order-i
carried
extension
state-of-the-art
capable
discussed
block-error
o
simulation
practical
union
hard-decision-decoded
greatly
neighbor
invested
referred
consequently
block
software
kasami
homogeneous
equally
computational
letter
computes
previously
tight
image
successive
year
bound
due
pair
appropriate
determine
balanced
proportional
shortening
bscss
terminated
modulo-m
additional
support
initial
bitsto-signal
fast
ordered
start
quadratic
inner
way
uÂ
naturally
function
building
medium
complete
form
offer
concatenated
pe
extended
histogram
construction
multilevel
unequal-error-protection
decoder
convergence
encoded
overflow
partitioning
coset
embedded
prevents
j
maximum
us
achieving
mize
limit
iteratively
distribution
called
high-speed
ac
associated
defined
certain
ki
describe
influence
al
mrr-based
general
single
reliability
implement
formulation
check
constructed
incorrect
ni
nj
compared
variety
telemetry
graph-theoretic
signal-to-noise
field
terminating
shannon
two-stage
spatial
test
poor
chase-type
sidel
superposition
calculating
lend
signal-set
symbol
includes
generated
important
bounded
q-ary
luep
variable
structure
hashing
billion
independently
tzeng
bch
longer
algorithm
practically
tanner
required
together
purged
tradeoff
devise
u
fact
ternary
time
n1
n2
starting
original
