aided
limited
code
consider
chain
caused
global
dynamic
focus
existing
four
manager
concept
ta-re
overlap
thesqlquery
hurdle
revealed
critical-twice
duplicated
end-users
depend
graph
concerned
technique
tween
fine-grained
finally
program
depending
stable
discovering
worth
sent
time-to-correction
case
risk
advantage
far
desirable
pected
every
programmerswho
affect
emphasized
difference
multiple
treating
entire
quality-meter
beating
open-source
level
issue
integrating
list
try
item
unrelated
team
small
markov
inspection
added
prevent
quicker
construed
application-specific
heterogenous
prediction
empirical
past
likely
cost
design
value
ter
crosscutting
lesser
unavailable
assistance
access
version
suspect
conduct
semiautomatically
new
bug-fix
method
co-change
vali
predicting
degree
exchange
error
component
reported
explore
operating
granularity
apache
causality
along
strong
change
obtained
search
property
involved
cross-cutting
vulnerability
allows
restructuring
experience
ignoring
suggests
amount
resulting
suggestion
usually
suitable
numerical
emerge
formulated
useful
discontinuous
problematic
manage
sample
highly
visible
api
trained
apply
txt
unit
environment
archived
discus
would
prove
browse
beginning
one-day
contains
two
process
duplicate
call
therefore
memory
sought
associated
selects
tell
today
sort
sharing
correlate
company
mozilla
benchmark
occurred
realized
train
everywhere
particular
known
actual
detects
effort
evolves
account
word
g
aspect-oriented
effectively
recall
challenge
work
eclipse
reproduce
huge
cation
bechanged
rately
evolved
growing
making
example
address
history
control
challenging
indicated
give
predict
programming
stressing
dueto
contradicts
refine
proof-of-concept
scheduling
validated
occur
information
gcc
indifferent
goal
rather
describes
damage
argouml
necessary
answer
place
explains
undertook
map
designer
description
binary
may
requires
earlier
derived
unobtrusive
collection
multitude
informs
produce
designed
date
data
annotation
engineering
efficiently
bar
company-specific
natural
third
whenever
quantify
documentation
element
provide
complexity
increasing
correlation
benchmarking
order
initdefaults
apfel
prioritizing
evolutionary
help
evant
developed
pointed
altogether
non-semantic
entity
paper
frequency
still
ieee
layout
developer
perfect
machine
style
interesting
fix
top-10
better
window
choose
locationwith
total
hidden
contextual
might
replicating
good
combination
ibugs
python
propose
indexing
introduce
functional
framework
half
feature
dataset
visualize
maintaining
structural
easily
term
finite
tise
infozilla
presented
identified
merge
token
check-in
batch
aligns
found
identifies
difficult
characterized
mean
cuezilla
conceiving
domain
significantly
undetectable
hundred
met
idea
related
investigated
static
connect
measure
plementation
relates
operation
beyond
extract
hatari
special
er
large
simplify
rics
network
sector
quality
furthermore
outlier
crucial
viability
research
increase
re
encourage
investigation
rel
field
newly
engineer
evaluation
correct
assurance
predicted
ass
assist
theory
symbolic
localization
upon
activity
given
contrast
ex
reason
base
success
backed
bug-introducing
estimate
likelihood
card
annotated
advance
language
could
impose
modularity
running
cross-company
turn
conducted
dereferencing
1970s
consequence
ture
trickle
facilitate
assign
first
widely-used
industrial
predictive
researcher
relate
stantial
coding
number
rank
one
well-known
done
long
another
frequently
impossible
open
maple
size
little
rated
termined
leverage
indicate
introduction
unknown
system
adopted
parallel
needed
assumption
statement
show
corpus
especially
post-release
prone
mining
lot
relationship
tool
helpful
serve
accurately
artifact
wisdom
part
business
percentage
Ã½ve
jump
quasoledo
b
effective
proposing
isolation
anticipate
iteration
second
submitted
project
erose
future
schema
treated
risky
collecting
debugging
addressing
false
recommen
ran
dynamically
modern
turned
defect
raw
man-years
exper
need
sap
vulnerable
relatively
extensible
built
mapping
efficient
responsible
able
the-art
also
empirically
potential
pivotal
build
attempted
finding
performance
detector
effectiveness
accuracy
failure-prone
experienced
altered
trace
reach
algebraic
jedit
viously
plan
significant
preliminary
phase
history-based
class
manifested
sub
bugintroducing
cause
observation
considered
average
sometimes
differ
face
looked
moderate
workspace
left
typically
incomplete
quantity
precise
2m3
selection
nsxpinstallmanagerbecause
visualizes
violation
text
random
scattered
ending
visualized
toguide
find
impact
jboss
indicator
infor
based
knowledge
implementation
much
cross-project
cache
distributed
behind
experiment
touched
factor
integrate
ranking
insight
dustrial
pendency
de
overall
kind
truly
roseprototype
import
report
tossed
industrial-sized
reveal
evolution
resolve
resource
consisting
remove
patch
investigate
common
contain
release
uncover
fixed
automatic
require
view
scanning
requirement
set
art
aspect
burst
tree
testing
module
package
depends
actively
communi
result
well-documented
content
close
drawing
best
concern
lucene
detect
expert
discovered
pattern
reporter
homogenous
topmost
reassigned
state
various
correctly
progress
approach
across
available
comparable
infrastructure
recently
statistically
extend
heuristic
initially
deliver
attention
subject
however
analyzes
blame
benchmarked
response
interface
separately
come
improve
faced
c
providing
plugin
fault
taking
density
event
abstraction
etc
connection
context
focused
estimation
whole
asked
experimental
con
comment
among
relevant
pose
point
simple
deal
others
scattering
community
subgraphs
analyzed
exploit
simply
stretched
learning
respect
actually
cv
late
java
capable
addition
stitute
create
three
quickly
extraction
workshop
responder
combined
maintenance
basic
porting
prototype
anomaly
define
person-hours
life
describe
partly
cept
sufficient
transferring
precision
mine
relevance
accident
understand
mapped
assigning
present
applied
extracted
exception
novel
look
publicly
align
single
evaluated
act
employ
near
encountered
evaluating
many
expertise
tant
study
seven
changed
motif
coupled
almost
metric
thus
surprisingly
mostly
bias
im
commonly
wisely
regression
increased
capture
different
develop
since
interactive
author
suggest
make
leveraged
locking
archive
member
complex
dierent
widely
largest
survey
reminder
several
conflict
higher
development
evolve
used
practitioner
comprehensive
reporting
driver
effect
discover
moment
user
triaging
validate
stack
recent
lower
tracking
whose
database
com
fault-prone
contest
well
spent
analysis
fkeys
bugzilla
greatest
fixing
organization
model
two-step
non-trivial
dynamine
proposed
tossing
accurate
obtain
valuable
assigned
identify
predicts
plug-in
alternative
speed
yet
previous
begin
task
gather
ham
candidate
instance
rose
supply
attractive
confirmed
source
add
location
easy
usage
extensive
mod
take
resolved
state-of
reuse
ample
showing
vulture
possible
early
burden
guide
using
execution
aspectj
color
formal
loss
promising
imposed
like
submission
manual
resolv
server
specific
collect
benefit
non-program
always
popular
security
essential
grouping
mathematical
consensus
often
classical
reveals
successfully
back
library
calling
predictlikely
towards
expected
recommendation
conveys
guess
neglecting
provided
scale
proceeding
pinpoint
lead
poorly
broad
decision
recorded
integration
hour
considers
rarely
e-mail
allocate
provides
prof
mined
manifest
core
inaccurate
repository
performed
real-world
architec
notable
use
notably
step
although
exciting
impor
readability
analysing
co-addition
helping
central
getting
sepa
industry
enhancement
reduced
practical
dependency
involving
positive
mixed
commit
introduced
predictor
automatically
software
naÂ
consulting
el
previously
communication
within
harm
negative
determine
objectoriented
annotating
rely
computer
additional
support
initial
question
mation
submit
pared
low
way
analyze
leading
naturally
function
underestimated
recommends
complete
subgraph
apis
great
defect-prone
recommend
failure
cycle
automated
line
migrating
true
bug
longer
usefulness
space-time
commonality
compute
algorithm
wish
shown
dations
us
record
economic
verification
mature
demonstrate
problem
piece
similar
called
reusing
obtains
later
proved
af
defined
recognize
domino
year
influence
direction
evidence
examine
exist
together
file
formulation
lifetime
ing
programmer
traditional
compared
completeness
pre
locality
personnel
individual
mathematica
generally
lately
power
application
valid
functionality
test
bug-fixes
revision
newsgroups
indetectableby
mismatch
update
variation
aset
crosscut
chance
important
intent
additionally
studied
variable
structure
architecture
correlated
e
coupling
syntactical
cross-cuts
rule
passed
u
presenting
outperformed
time
serious
validation
starting
original
