represent
concept
consider
similarity
varying
dynamic
focus
computation
consists
particularly
chair
devoted
whose
dimensionality
graph
technique
environment
finally
acoustically
rhythm
stochastic
presentation
data-driven
case
global
provides
wave
manipulated
affect
difference
condition
posture
disturb
non-identical
level
stimulus
criterion
vector
nonspeech
enhance
perceptual
multi-parametric
facilitating
summarizes
human-computer
itive
second
design
incrementally
tactile
sug
nonlinear
cover
sonification
section
selected
current
version
dendrogram
new
model-based
deemphasize
method
contrast
movement
body
synthetic
segmentation
full
simultaneously
lee
promising
component
understanding
refinement
explore
subdivides
address
active
ratio
teacher
obtained
search
exemplified
study
allows
ment
amount
periodic
resulting
suggestion
browsing
navigation
useful
mediator
motor
marker
apply
manipulate
plot
use
non-monotonic
discus
positive
coupled
two
tightly
error
incremen
camera
music
therefore
associated
theoretical
today
introducing
successful
binding
musician
glass
visual
controlling
stick
real-time
iii
must
synchronizer
account
defines
polyrhythmic
mb
work
oscillator
violinist
obvious
learn
following
making
example
performed
control
claim
multaneous
figure
give
process
attribute
haptic
lay-on
boxâ
cation
taking
sense
tions
non-verbal
counterpart
monitoring
varied
provide
mouse
feature
machine
reducible
sid
optimal
glare-free
parameter
oscillatory
map
informa
ubiquitous
intended
utilise
information
may
containing
tied
accessory
designed
participant
law
data
grow
stress
natural
dynamical
bind
element
rather
si
environ
correlation
representation
first
order
gesture
feedback
developed
pointed
insight
argues
paper
keyboard
pca-based
style
group
auditory
interesting
temporal
solving
platform
according
differently
inquiry
main
ausoms
conveying
motivated
thereby
propose
practice
regarding
introduce
devel
band
bang
resource
inspect
growing
term
fully
presented
identified
privileged
applied
transmitted
mode
acoustic
mean
subset
development
domain
en
fication
generation
series
energy
hard
positioned
idea
sonifications
frequency
static
ex
measure
principled
event
special
shown
network
acoumo
space
open
furthermore
since
research
investigation
adaptive
hci
issue
integrated
perception
3d-space
mapping
difficulty
nucleusâ
put
generate
additional
hardware
interaction
determining
transition
motion
length
place
crystallization
think
opment
major
oni
relate
one
proposing
compared
quality
concert
given
explicable
limited
discussed
service
system
needed
inconvenient
exploring
mining
relationship
eye-tracker
tool
continuous
artifact
tracking
manipulation
ausom
outline
over-emphasis
kind
b
cyclic
instruction
rate
actively
sens
tion
playing
proactive
interactive
rhythmic
generalization
audifications
need
constrained
demonstration
modality
controlled
generalizes
strength
angle
exploratory
depending
lim
responsible
able
complexity
mechanism
extracted
internal
precomputation
impairment
supporting
channel
even
play
multiple
track
object
sequence
unobtrusively
optimized
regular
plan
successive
device
future
intrinsic
exponent
subjective
stereo
paradigm
constructed
neighboring
alarm
flow
instrument
musical
hierarchical
artistic
framework
gest
assisted
fact
emerging
closed-loop
show
infrared
acoumotion
subtle
decade
based
knowledge
implementation
identification
local
dependent
joint
shared
report
queried
evolution
querying
embedded
yield
common
characteristic
view
set
art
constructing
analy
multivariate
physically
detection
intensity
computer
result
sport
arm
concern
detect
interacting
expert
crystal
pattern
review
artificial
state
determined
various
closed
neither
reading
approach
discovery
non-plannable
ability
complementary
importance
audiovisual
attention
subject
interface
rapidly
trolling
topology
reaction
c
tangible
modular
self-organizing
polyrhythms
sensitive
object-choice
workplace
context
distinction
contribution
adapted
asked
experimental
con
adjusted
point
color
exploit
badminton
adaptation
learning
consideration
non-visual
table
organisational
doesnâ
described
capable
three
strategy
workshop
combined
interest
basic
transformed
prototype
engine
direction
contribute
diversity
deeper
concerning
gas
great
improved
present
sound
novel
sonifi
empirical
value
excited
replaced
applies
aid
property
spotlight
loop
played
chaotic
neuron
thus
surface
equal
ii
characterize
unit
ambient
partner
technology
conserve
portray
different
develop
suggests
occupied
exemplifies
textile
exponentiation
another
complex
speech
emphasize
modification
several
infer
multi-modal
visually
used
effect
hand
average
data-space
moving
user
robust
functionality
recent
task
neural
minimize
macro
floor
well
analysis
directly
without
studying
organization
model
audio
dimension
proposed
obtain
topic
human
using
alternative
yet
previous
application
ease
characterization
blindminton
improvement
simple
extends
board
relevance
input
furniture
transformation
real
sonic
situation
early
game
listening
desk
world
intersection
like
cognitive
micro-structure
exploiting
performing
glove
specific
physiotherapy
follows
output
eeg
inter
reduced
ir-illumination
sketch
trained
classical
people
creation
offer
growth
questionnaire
supportive
recognition
scale
tracked
ubiquity
critical
select
scalp
prof
demonstrated
measuring
biofeedback
scientific
real-world
processing
tuition
deformable
introducescrystallization
gained
central
gaze
introduces
simulation
range
ensure
brings
introduced
software
rendered
additionally
communication
image
within
dataset
intu
rendering
appropriate
sor
clustering
fill
deal
area
2d-topologically
support
altitude
question
fast
start
describes
way
call
vibrotactiles
analyze
synthesis
function
medium
form
sofa
tally
extended
wireless
gestural
gain
convergence
line
faster
also
datasets
applying
intuitive
ploratory
attached
us
paired
exploration
continuously
demonstrate
problem
piece
similar
display
obtains
high-dimensional
ac
ordered
significance
computing
defined
certain
combining
dialogue
ar
expertise
ax
ing
physical
eye-movement
variety
whereas
storage
detail
reality
field
tactiles
role
digital
non-speech
node
draw
generates
collaborative
describe
variation
includes
generated
important
augmentation
allowing
suited
variable
structure
condensation
e
coupling
algorithm
assume
required
together
u
reprinted
time
augmented
