concept
similarity
caused
lack
dynamic
existing
illustrated
computation
disk
saved
technique
intensive
program
sorry
spec
uninitialized
applied
co-operation
balancing
fac
severely
level
cause
solution
specjbb2000
small
formanceandsoftware
cmp
prevent
version
periodicallyswap
consistent
surrounding
zero
design
evaluated
implemented
even
lilytask
availability
access
experiment
conduct
method
error
component
operating
change
tant
study
diagnosed
classification
reclaimed
vir
boolean
select
easy-to-use
use
consumption
positive
two
oecd
call
memory
type
expose
hurt
tested
tolerates
high
ibm
tual
work
eclipse
leaksurvivor
root
control
process
lock
chip
validates
topic
native
information
incurs
provide
machine
methodology
instead
map
prototypeof
demonstrates
prolix
data
parallel
introduced
four
representation
help
telecom
developed
paper
including
affect
pointer
developer
groupofthemostimpor
write
group
exclusion
solving
production
main
propose
safe
noc
slicing
iments
easily
hyper-plan
jected
overflow
inherent
opers
classifier
subset
domain
significantly
energy
ef
reduce
idea
ec
unlock
replay
static
stealing
patch
collector
space
availabilityforgarbage-collected
furthermore
detailed
contained
investigation
int2000
evaluation
correct
common
mance
mapped
free
diagnostic
care
training
language
replaying
programming
british
qualification
support
construct
management
top
system
garbage-collected
checkpoint
indicate
statement
subproblems
on-site
scheme
leaksurvivorextends
tool
continuous
environmental
part
manifestation
focusing
simula
tive
prune
double
tree
second
bed
project
future
tion
providing
debugging
false
pro
mine
outperforms
need
recover
occupied
built
latter
majority
potential
build
performance
detector
competence
accuracy
normal
buffer
object
regular
checkpointing
achievement
reoccurrence
average
later
subsequent
jvm-level
show
supported
pad-on
perfor
purely
relation
eliminated
based
implementation
distributed
hrm
sequential
fectively
de
degradation
synchronization
report
resource
tolerance
drc-bk
gram
contain
kernel
constructing
national
testing
packet
operates
achieves
result
exper
expert
control-dependence-based
currently
state
various
approach
available
state-of-art
concentrate
modeling
first-aid
c
irregular
avoid
programto
fault
improves
context
experimental
load
among
point
exploit
linux
applies
java
java-in-java
create
three
quickly
trigger
basic
flexible
pl
os-level
irrelevant
present
c4
case
tolerate
value
leaksurvivoron
promising
jikes
seven
pool
caep
lightweight
capture
different
cumulative
widely
higher
development
used
assignment
assist
upon
effect
allocation
user
bsplib
devel
stack
recent
task
well
analysis
without
fixing
organization
model
restore
proposed
transmitting
virtual
human
pattern-driven
captured
previous
also
topical
multi-processor
attractive
zero-efficient
remaining
interconnection
nvq
read
test
using
execution
necessary
benefit
imposes
whelming
security
grouping
network-on-chip
back
elderly
economic
home
energy-efficientdesignofbuffers
matching
hyper-plane
leak
decision
per
decomposition
provides
core
run
dangling
conventional
ontology
identifies
run-time
introduces
cmar
range
runtime
processor
automatically
software
garbage
recreate
re-execution
explict
jigsaw
long
low
way
suit
overhead
survives
long-running
buggy
failure
understandable
automated
detectorsfromthevir
potentiallyleaked
bug
applying
prevents
us
memoryobjectsidentifiedby
uk
problem
called
diagnose
cba
computing
certain
rvm
engineering
90nm
rule
swapped-out
lifetime
ing
cmos
mutual
compared
na
vocational
application
velopers
roll
ficient
generates
generated
additionally
structure
svm
e
restores
together
indirectly
u
parallelism
diagnosis
time
original
